{"old_nid":"10130581","title":"Britain and Ireland take early lead in Walker Cup","short_headline":"Britain and Ireland take early lead in Walker Cup","page_title":"Britain and Ireland take early lead in Walker Cup","slug":"AP-GLF--Walker Cup, 1st Ld-Writethru","headline":"Britain and Ireland take early lead in Walker Cup","description":null,"body":"<p>LYTHAM ST ANNES, England (AP)  Britain and Ireland enjoyed a 7-5 lead over holders United States on Saturday after the first day of the 45th Walker Cup on the links of Royal Lytham and St Annes.<\/p><p>The hosts led 3-1 after morning foursomes in northwest England of the biennial amateur event before the eight afternoon singles were shared, with each side winning three matches and the other two halved.<\/p><p>''Given our start this morning I was pleased with the way we came back this afternoon,'' United States captain John `Spider' Miller said.<\/p><p>The 37-year-old Scott Harvey, one of the senior members of the American team, won his singles by sinking a 55-foot putt at the 17th.<\/p><p>''There are 14 points available tomorrow, so being two down is not bad in the scheme of things,'' Harvey said after an enthralling day's play in blustery conditions.<\/p><p>There was never more than one hole in it in the first match between Bryson DeChambeau and Ashley Chesters. The American twice went one up on the front nine only for Chesters to pull him back. After the lead switched hands, DeChambeau leveled with his fifth birdie of the match at the 16th and they parred the two closing holes to share the spoils.<\/p><p>Hunter Stewart was one down for the U.S. with three to play against Paul Dunne but birdied the 16th and 18th and parred the 17th, when Dunne three putted, to win the match by two holes.<\/p><p>Another American point came when Scott Harvey won the 16th with a par and then took the match 2 and 1 when he sank a 55-foot birdie putt at No. 17 when Grant Forrest narrowly missed a birdie.<\/p><p>England's Jimmy Mullen got the first singles point on the board for Britain and Ireland when he beat Denny McCarthy by two holes. Mullen played faultless golf with 14 pars and four birdies at Nos. 9, 12, 13 and 18.<\/p><p>Maverick McNealy was never ahead against Ewen Ferguson, but came back from three down after seven to take him to the 18th where the Scot won by one hole.<\/p><p>Gavin Moynihan claimed Britain and Ireland's third singles point with a 4 and 2 win over Jordan Niebrugge.<\/p><p>Robby Shelton was three up after seven in his match with another Irishman Gary Hurley, but ended up halving the match.<\/p><p>Beau Hossler for the U.S. was three down after 10 holes against Ireland's Jack Hume but fought back to win by one hole.<\/p><p>Earlier, Britain and Ireland took a 3-1 lead after the morning foursomes in windy conditions.<\/p><p>English pairing Chesters and Mullen claimed the first point for the home side with a 3 and 2 victory over McNealy and Stewart.  Ireland's Cormac Sharvin and Scotland's Jack McDonald dominated Jordan Niebrugge and Shelton, winning three of the first four holes on their way to a 5 and 4 victory.<\/p><p>Hossler and Denny McCarthy claimed the Americans' only point in the third match with a 3 and 1 win over Irish pair Dunne and Hurley. The second Irish pair of Hume and Moynihan never trailed in their match against Lee McCoy and Mike McCoy before winning 3 and 2.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10133451","10133456","10133461","10133466","10133471","10133476","10133481"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-12 15:42:39","updated_date":"2015-09-12 15:50:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150912083957436536708","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/12\/ap-glf-walker-cup"}