{"old_nid":"10050486","title":"No. 1 up for grabs at 2nd playoff event in Boston","short_headline":"No. 1 up for grabs at 2nd playoff event in Boston","page_title":"No. 1 up for grabs at 2nd playoff event in Boston","slug":"AP-GLF--On The Tee","headline":"No. 1 up for grabs at 2nd playoff event in Boston","description":null,"body":"<p>NORTON, Mass. (AP)  The second FedEx Cup playoff event is all about the Big Three.<\/p><p>And the battle for No. 1.<\/p><p>Rory McIlroy returned to No. 1 in the world even though he skipped opening playoff event last week at The Barclays. That's mostly about math, and an indication that McIlroy and Jordan Spieth are running nose-to-nose at the moment. Spieth has the easiest road back to No. 1 this week and likely only has to finish ahead of McIlroy.<\/p><p>Jason Day, coming off his six-shot victory at The Barclays, would have to win to have any chance.<\/p><p>The Deutsche Bank Championship gets underway Friday, and at least for the moment, the focus has shifted from the race for the $10 million bonus by winning the FedEx Cup to a world ranking that figures to keep changing over the next few months.<\/p><p>Tee times Friday at the TPC Boston are based on the FedEx Cup standings, meaning Day, Spieth and Bubba Watson will be in the same group for the opening two rounds. McIlroy slipped six spots to No. 15. He will be a couple of group ahead of them alongside Hideki Matsuyama and Kevin Kisner.<\/p><p>The original ''Big Three'' were Arnold Palmer, Jack Nicklaus and Gary Player - all were represented by IMG founder Mark McCormack.<\/p><p>That led one reporter to ask Day and McIlroy which of the old ''Big Three'' they best resembled.<\/p><p>And both picked Player.<\/p><p>''He was the smallest,'' McIlroy said. ''Yeah, I'd probably be Player. Sitting here in 30 year's time, if I had the career he head, I'd be pretty happy.''<\/p><p>Yes, but how many pushups can McIlroy do?<\/p><p>''Probably not as many as him,'' he said.<\/p><p>Day also went with Player, later adding that he hoped to win enough tournaments to rate with Palmer and Nicklaus. Day has six, so he has some work to do.<\/p><p>''It's funny to look at it that way,'' Day said. ''This is a totally different era. Back then, these are the guys that put golf on the platform that we're on today. Arnold changed the way we look at golf. He came out when TV came out and really made golf sexy. Jack with his dominance. And then obviously, Gary being an international player, and also dominant, made a lot of fun golf to be watched.''<\/p><p>Here's what to watch for Friday:<\/p><p>THE BASICS: Only the top 100 in the FedEx Cup standings qualified for the Deutsche Bank Championship, and two players have withdrawn. Sergio Garcia, who also skipped last week, has dropped to No. 43. Wil Wilcox had an injury. He was No. 89, so his season is over.<\/p><p>The magic number for the week is 70. That's how many players advance to the BMW Championship north of Chicago in two weeks.<\/p><p>For all the talk about the Big Three, Spieth said there were 100 players ''fully capable of having four good days and winning this event, and hopefully that can be me.''<\/p><p>The TPC Boston has been favorable to the higher seeds.<\/p><p>Only one winner - Charley Hoffman at No. 59 - outside the top 15 in the FedEx Cup standings has won the Deutsche Bank Championship.<\/p><p>Those are just the winners. A year ago, Geoff Ogilvy was No. 100, had a hot stretch for 27 holes, tied for second and went all the way up to No. 24.<\/p><p>---<\/p><p>THE STREAK: Hunter Mahan, barring a quick turnaround, is on the verge of ending the longest streak in the FedEx Cup era.<\/p><p>Mahan has never missed a playoff event since this lucrative series began in 2007. He was in trouble a year ago, but only briefly. He was No. 62 going into the playoffs and won The Barclays, sending him to one of the coveted top five seeds at the final tournament at East Lake.<\/p><p>Mahan is No. 91 going into the TPC Boston. The streak ends unless he can at least get to No. 70.<\/p><p>---<\/p><p>THE PRESIDENTS CUP: Another streak already has ended.<\/p><p>Phil Mickelson has qualified for every Presidents Cup team since it began in 1994. He was eliminated last week at The Barclays. Even if Lefty were to win the Deutsche Bank Championship, he would not crack the top 10. So his only hope is a win - or at least close to a win - to get one of the two captain's picks by Jay Haas.<\/p><p>Mickelson has been part of every Presidents Cup and Ryder Cup team since 1994. That's 20 in a row.<\/p><p>Chris Kirk is holding down the 10th spot, and Bill Haas (No. 11) would need fifth place to have a chance to move past him.<\/p><p>For the International team, Danny Lee is narrowly ahead of Steven Bowditch, with John Senden still in range. That team is decided by the world ranking.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10006581","10044196"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-04 02:26:25","updated_date":"2015-09-04 02:47:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150904022550217840008","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/04\/ap-glf-tee"}