{"old_nid":"10213761","title":"Europe takes 10-6 lead over US going into Solheim singles","short_headline":"Europe takes 10-6 lead over US going into Solheim singles","page_title":"Europe takes 10-6 lead over US going into Solheim singles","slug":"AP-GLF--Solheim Cup, 9th Ld-Writethru","headline":"Europe takes 10-6 lead over US going into Solheim singles","description":null,"body":"<p>ST. LEON-ROT, Germany (AP)  After being infuriated by a call they found unsportsmanlike, the Americans staged the biggest comeback in Solheim Cup history Saturday to wrest the trophy back from Europe.<\/p><p>Paula Creamer defeated Germany's Sandra Gal to complete the turnaround and secure a 14 1\/2-13 1\/2 victory for the United States, which had trailed by four points going into the singles.<\/p><p>The match turned after American rookie Alison Lee was penalized for picking up the ball when she thought her putt was conceded in the morning fourballs, which had been suspended on Saturday. The 20-year-old missed a birdie putt on the 17th hole and then picked up the ball as Europe's Charley Hull was already walking toward the last hole - only for Suzann Pettersen to claim Europe hadn't conceded the short putt. The umpire intervened and Europe was awarded the hole - and eventually won the match.<\/p><p>''There's no way they could ever justify that. I don't care what you say, you just don't do that to your peers,'' U.S. captain Juli Inkster said. ''I don't know if my team needed to be fired up anymore, but they were real fired up.''<\/p><p>And they dominated the singles to claim their first title since 2009, denying the Europeans their first threepeat. The U.S. extended its series lead to 9-5. No team had ever come from more than two down going into the singles.<\/p><p>''I am so proud of our team. We were in there this morning and we were just so fired up and ready to get out there and just play good golf,'' Creamer said. ''And this was so awesome. I played great. Seeing the girls and seeing the red on the board, I'm so proud of them.''<\/p><p>Europe led 10-6 going into the 12 singles but could only win three and draw another. Home golfer Caroline Masson missed the last big chance to retain the cup for Europe, before Gerina Piller made her more difficult 9-foot putt to win her match by one hole and keep American hopes alive.<\/p><p>Cristie Kerr then had nine birdies in 11 holes as she beat Hull 3 and 2, and Angela Stanford ended her nine-match losing streak to beat Pettersen 2 and 1, before Creamer completed the turnaround.<\/p><p>Morgan Pressel, Alison Lee, Michelle Wie and Cristie Kerr also won for the U.S., while Lexi Thompson won half a point in her all-square match against Carlota Ciganda of Spain.<\/p><p>''This is probably the closest knit group we've ever been a part of. We never stopped believing,'' Stanford said.<\/p><p>Pressel defeated Catriona Matthew of Scotland by 2 holes, Lee defeated Gwladys Nocera of France 3 and 1, Wie had eight birdies in a huge 6 and 4 win over Caroline Hedwall of Sweden, while Lizette Salas defeated Azahara Munoz of Spain 3 and 1.<\/p><p>Karine Icher of France defeated Brittany Lincicome 3 and 2, Melissa Reid of England beat Brittany Lang 2 and 1, and Anna Nordqvist of Sweden finished with a birdie to best Stacy Lewis 2 and 1.<\/p><p>But after an emotional day, it seemed it was the Americans who had actually benefited from the controversial call against Lee.<\/p><p>Both Lee and Hull were in tears after that match, and Inkster used the incident as motivational fuel in her team talk before the singles.<\/p><p>''Charley was walking off the green and Suzann was already off the green so there was no doubt in my mind that that putt was good,'' Lee said. ''I didn't even think twice about it. So I just picked it up.''<\/p><p>Europe captain Carin Koch said the ball went too far to concede.<\/p><p>''The rules are the rules. You have to follow the rules,'' Koch said.<\/p><p>After lifting the trophy, Inkster was ready to move on from the controversy.<\/p><p>''I'm over it,'' she said. ''We got the cup.''<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10214991","10215281","10215286","10215291","10215296","10215301"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-20 12:05:46","updated_date":"2015-09-20 12:17:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150920044105707089108","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/20\/ap-glf-solheim-cup-1st-ld-writethru"}