{"old_nid":"10146591","title":"Annie Park wins 3rd Symetra Tour title of year","short_headline":"Annie Park wins 3rd Symetra Tour title of year","page_title":"Annie Park wins 3rd Symetra Tour title of year","slug":"AP-GLF--Symetra Tour, 1st Ld-Writethru","headline":"Annie Park wins 3rd Symetra Tour title of year","description":null,"body":"<p>MAYETTA, Kan. (AP)  Annie Park won the Prairie Band Casino & Resort Charity Classic on Sunday for her third victory in nine Symetra Tour starts this season.<\/p><p>Park earned $15,000 to jump from fourth to second on the money list with $66,125, more than enough for a 2016 LPGA Tour card as a top-10 finisher.<\/p><p>''It has been a lifelong dream of mine to play on the LPGA since I started golf when I was 8 years old,'' Park said. ''I looked up to Annika Sorenstam and I knew I wanted to be like her when I grew up. I'm speechless and I can't wait to play on the LPGA next year.''<\/p><p>The 20-year-old former Southern California player from Levittown, New York, closed with a 7-under 65 at Firekeeper for a three-stroke victory. She finished at 13-under 203.<\/p><p>''My goal coming into the round was just to make a lot of putts because I missed a few in the first two rounds,'' said Park, the 2013 NCAA individual champion. ''I was hitting and putting well, so it was a great day.''<\/p><p>Park is the 10th player in tour history to win at least three times in a season. She won in July in Rochester, New York, and last month in Milwaukee, and has 23 consecutive rounds of even par or better - breaking par in 21 of them.<\/p><p>''My first two wins were pretty unexpected and I'd say this one was, too,'' Park said. ''I had a blast on the Symetra Tour with my friends Grace (Na), Jennifer (Yang) and Kimberly (Kim). All the players are so nice on tour and it didn't even feel like playing tournament golf sometimes.''<\/p><p>Her mother, Ann, is working as her caddie on the tour.<\/p><p>''On and off the course, my mom keeps me happy and having fun,'' Park said. ''I love traveling with her. Not only does she caddie, but she cooks and drives. She gets the super mom award. She has been my hero, too, growing up.''<\/p><p>Mexico's Margarita Ramos was second after a 69.<\/p><p>Brittany Altomare shot a 71 to finish third at 8 under.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":[],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-13 21:56:46","updated_date":"2015-09-13 22:03:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150913190307574759008","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/13\/ap-glf-symetra-tour"}