{"old_nid":"10162806","title":"Feherty to join NBC golf coverage","short_headline":"Feherty to join NBC golf coverage","page_title":"Feherty to join NBC golf coverage","slug":"AP-GLF--Feherty-NBC, 3rd Ld-Writethru","headline":"Feherty to join NBC golf coverage","description":null,"body":"<p>LAKE FOREST, Ill. (AP)  David Feherty signed a contract with NBC Sports that will put him on the broadcast team with Johnny Miller, allow him to extend his popular ''Feherty'' series on Golf Channel and possibly lead to new ventures for golf's funnyman.<\/p><p>''It's a thrill, just the thought of it, and a new step in my career,'' Feherty said Tuesday. ''And I can't wait to get started.''<\/p><p>Feherty had been with CBS Sports for nearly two decades and developed into one of golf's most famous on-course reporters with his mix of irreverence and Irish humor. He didn't renew his contract after CBS' final golf broadcast at The Barclays three weeks ago.<\/p><p>NBCUniversal will be his exclusive network home, meaning Feherty likely will be working all four days of tournaments that are broadcast by Golf Channel on the weekdays and NBC Sports on the weekend. He will split time between analysis from the tower and on the ground.<\/p><p>Feherty gives up the Masters, the biggest of CBS telecasts, in exchange for the Ryder Cup, the Olympics next year in Rio and the British Open starting in 2017. The Open will go to Royal Portrush in his native Northern Ireland in 2019.<\/p><p>Tommy Roy, the executive producer for golf at NBC Sports, said the hiring comes at a time when Roger Maltbie and Gary Koch are cutting back on the number of tournaments they work each year.<\/p><p>Feherty starts his new role in January.<\/p><p>The 57-year-old Feherty won five times on the European Tour and played in the 1991 Ryder Cup at Kiawah Island. He first did TV work at the old Johnnie Walker Championship in Jamaica. Among his first big roles for CBS was the 1997 Masters, when Tiger Woods shattered records with a 12-shot victory at age 21. Feherty once recalled his assignment that Sunday - getting Woods to say a few words when he arrived at the club.<\/p><p>''My whole career hinged on getting Tiger Woods to say a few words into the camera,'' Feherty said 10 years later. ''He got out of the car and ... I had seen him before, but I've never seen that look. He looked radioactive. I thought, `Who needs this career?'''<\/p><p>It worked out for him, and he gained more notoriety with ''Feherty,'' in which he has interviewed golf and sports celebrities, including Donald Trump in 2012.<\/p><p>''It goes without saying how much his wit spices up a telecast, but his ability to analyze in my opinion, like he has at the Masters, is off-the-charts good,'' Roy said. ''And I think under our system, David will have the ability to provide even more depth to his analysis, and I think our events fit right in his wheelhouse.''<\/p><p>''I'm so looking forward to hearing the repartee between David and Johnny Miller,'' he said. ''It's going to be some pretty damned good television.''<\/p><p>Miller was among those on Feherty's show in the early days.<\/p><p>''Johnny has got a great heart, very kind, but brutally honest,'' Feherty said. ''I really admire that in a person, that honesty. You just say what you feel sometimes, the first thing that comes into your head. It can get you in trouble, and I'm familiar with that, but it's always refreshing.''<\/p><p>---<\/p><p>This story corrects the eighth paragraph to five wins on the European Tour for Feherty, instead of 10.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10170506"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-15 22:03:51","updated_date":"2015-09-15 22:11:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150915092044509615408","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/15\/ap-glf-feherty-nbc"}