{"old_nid":"10113306","title":"SMU's DeChambeau uses physics and irons for rare dual titles","short_headline":"SMU's DeChambeau uses physics and irons for rare dual titles","page_title":"SMU's DeChambeau uses physics and irons for rare dual titles","slug":"AP-GLF--DeChambeau-Physics and Irons, 1st Ld-Writethru","headline":"SMU's DeChambeau uses physics and irons for rare dual titles","description":null,"body":"<p>Bryson DeChambeau is a physics major with a unique approach to golf, and a set of irons all cut to the same length.<\/p><p>There is also the Ben Hogan-style cap the SMU senior wears when he plays, and the rare distinction that added him to a group of elite golfers: Jack Nicklaus, Phil Mickelson, Tiger Woods and Ryan Moore.<\/p><p>''I've been practicing my whole life for something like this, and to be able to finally do something history-worthy, I guess you could say is incredible,'' said DeChambeau, only the fifth golfer to win both the U.S. Amateur and NCAA individual titles in the same year.<\/p><p>All with a swing of his own developed over years of experimentation since his coach, Mike Schy, threw the book ''The Golfing Machine'' at a then-15-year-old with the goal of being the best ball-striker in the world.<\/p><p>''It was a really difficult read, it was a college textbook, it was a foreign language to me,'' DeChambeau said. ''But after a couple of years of guidance from Mike, we came up with a single-plane swing ... it's called zero-shifting motion, more technically, and it's helped me become the player I am today.''<\/p><p>DeChambeau explained that the book showed 24 components to a swing, with about 144 variations throughout those components. He picked a specific set of variations to come up with his swing.<\/p><p>That swing is then repeated over and over since all of DeChambeau's iron shafts are about 37 1-2 inches long with differently weighted heads That allows him to consistently use the same motion, whether hitting a long iron or a pitch shot.<\/p><p>''I'm able to keep my posture the same, the swing is relatively the same, and it's a lot easier to control the clubface because they're relatively the same swing speed,'' he said. ''I have a very good guestimate ... I've been able to understand how far I can hit it through those repetitions.''<\/p><p>DeChambeau last month won 7 and 6 over Virginia junior Derek Bard in the 36-hole final at Olympia Fields to claim the U.S. Amateur title. DeChambeau started the summer with a one-stroke victory over Washington's Pan Cheng-Tsung for the NCAA individual title.<\/p><p>''I believe in myself that I can pull the shots off at any given point in time,'' DeChambeau said.<\/p><p>This weekend, days before his 22nd birthday, he is in England with the U.S. team in the Walker Cup for match play against a team of players from Britain and Ireland.<\/p><p>After that, DeChambeau plans to stay in school to finish work on his major and expects to play his final season with the Mustangs. As amateur champion, he would receive invitations to play next year in the Masters, the U.S. Open and the British Open.<\/p><p>The California native said he feels no pressure to turn pro right now, even while going to college in the hometown of 22-year-old Jordan Spieth, the Masters and U.S. Open champion.<\/p><p>''He's different than me, so we all have our individual ways to get there. I'm going my route,'' DeChambeau said. ''I'm not thinking about the future. I'm thinking about right now, and what I can do not only for my school, but my country.''<\/p><p>With his own swing and same-sized irons.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10113631","10113636","10113641"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-10 14:16:32","updated_date":"2015-09-10 14:30:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150910135548193186908","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/10\/ap-glf-dechambeau-physics-and-irons"}