{"old_nid":"10141136","title":"Britain and Ireland takes 10-6 lead in Walker Cup","short_headline":"Britain and Ireland takes 10-6 lead in Walker Cup","page_title":"Britain and Ireland takes 10-6 lead in Walker Cup","slug":"AP-GLF--Walker Cup, 3rd Ld-Writethru","headline":"Britain and Ireland takes 10-6 lead in Walker Cup","description":null,"body":"<p>LYTHAM ST ANNES, England (AP)  Britain and Ireland regained the Walker Cup with the team's highest points total on Sunday, beating the United States 16.5 to 9.5 at Royal Lytham and St Annes.<\/p><p>Leading 7-5 after the first day of the biennial amateur event, Britain and Ireland again won the morning foursomes 3-1 to lead 10-6.<\/p><p>That left the hosts needing just 3.5 points from the 10 afternoon singles, and Britain and Ireland clinched victory with six matches still out on the course on England's north west coast.<\/p><p>''We fought hard and lost with grace and dignity, that's what sport is all about,'' said United States captain John `Spider' Miller.<\/p><p>Britain and Ireland captain Nigel Edwards, a four-time Walker Cup player, also led his team to victory at Royal Aberdeen in 2011.<\/p><p>''The lads' short games are fantastic, which is probably what has given us the edge,'' Edwards said. ''Some of the bunker shots were exceptional.''<\/p><p>England's Ashley Chesters and Jimmy Mullen and Ireland's Cormac Sharvin won three of the first four singles before Paul Dunne, who shared the lead after three rounds of this year's British Open, halved his match with Maverick McNealy to seal victory.<\/p><p>Chesters' 3 and 1 victory over Jordan Niebrugge gave him 3.5 points out of a possible four while his England teammate Mullen claimed his fourth point with a 3 and 2 win over Denny McCarthy.<\/p><p>Sharvin's 4 and 3 win over Mike McCoy also gave him a perfect record with three wins in three matches. He was four up after six holes against the veteran American and, although McCoy got it back to two by the 11th, Sharvin regained his four-hole advantage with birdies at the 12th and 14th.<\/p><p>Dunne always had the edge against McNealy, who never held the lead but could have won it on the 18th. Dunne putted first from eight feet and missed, leaving McNealy with a five footer to win the match, but the ball slid by, giving Britain and Ireland victory.<\/p><p>There were further home wins for Scotland's Grant Forrest, who beat Scott Harvey 2 and 1, and Gary Hurley, who won by one hole against Hunter Stewart.<\/p><p>Bryson DeChambeau claimed the biggest win of the whole competition, beating Gavin Moynihan 6 and 5, and Beau Hossler was the only other U.S. singles winner Sunday, edging out Ewen Ferguson with a birdie at the final hole.<\/p><p>Hossler got the most points for the U.S., winning three of his four matches.<\/p><p>Earlier, in the morning session, English pair Chesters and Mullen claimed their second foursomes win, fighting back after losing the first two holes to beat Hossler and McCarthy 3 and 2.<\/p><p>Dunne and Hurley got the home side's second point with a one-hole victory over Mike McCoy and Harvey, while DeChambeau and Robby Shelton won the sole U.S. point, beating Moynihan and Jack Hume 3 and 2.<\/p><p>Britain and Ireland's final morning point came in a see-saw match, with Sharvin and Jack McDonald beating Stewart and Lee McCoy by two holes.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10141381","10141386","10141391"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-13 14:52:20","updated_date":"2015-09-13 15:00:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150913081542398413008","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/13\/ap-glf-walker-cup"}