{"old_nid":"10085811","title":"Lahiri, Thongchai hope to trailblaze at Presidents Cup","short_headline":"Lahiri, Thongchai hope to trailblaze at Presidents Cup","page_title":"Lahiri, Thongchai hope to trailblaze at Presidents Cup","slug":"AP-GLF--Presidents Cup-Asia","headline":"Lahiri, Thongchai hope to trailblaze at Presidents Cup","description":null,"body":"<p>NEW DELHI (AP)  Anirban Lahiri and Thongchai Jaidee hope their milestones as the first golfers from India and Thailand to be picked for the Presidents Cup inspire kids in their countries.<\/p><p>They qualified on their world rankings, making the top 10 automatically on the International team.<\/p><p>Lahiri, who tied for fifth at the U.S. PGA Championship, was ranked 40th, and Thongchai 44th.<\/p><p>Thongchai, the playing captain for Team Asia in a 10-10 draw with Team Europe in the inaugural EurAsia Cup last year, was looking forward to their participation in the tournament in Incheon, South Korea, next month boosting golf's popularity in Asia.<\/p><p>''It can help the other young Asian players,'' he said. ''When they see that I can get into the team, then they, too, will aim for it.''<\/p><p>Golf news is generally buried in the Indian media, unless it's a home event or an Indian does well. Only in recent years have the majors received prominent attention.<\/p><p>Lahiri said he grew up watching team events such as the Ryder Cup, and was thankful he had something like the Presidents Cup to aim for.<\/p><p>''It'll be a massive boost for golf in the region,'' Lahiri said. ''You get so many eyeballs, and everybody in America will be watching.<\/p><p>''To be a part of something historic like that is extremely special. All I want to do is make sure that I get a point for the International team.''<\/p><p>Asian Tour chairman Kyi Hla Han said he was delighted with Lahiri and Thongchai.<\/p><p>''We expect them to contribute immensely toward the International team's attempt to regain the Presidents Cup, but ultimately, their presence will boost the development of the game across Asia,'' he said. ''Young golfers will have another reason to aspire for the top, and with Japan's Hideki Matsuyama also in the team, it proves that Asian golf has grown in stature and strength.''<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":[],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-08 05:36:59","updated_date":"2015-09-08 05:42:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150908053646765945408","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/08\/ap-glf-presidents-cup-asia"}