{"old_nid":"10185351","title":"US, Europe vie for underdog status ahead of Solheim Cup","short_headline":"US, Europe vie for underdog status ahead of Solheim Cup","page_title":"US, Europe vie for underdog status ahead of Solheim Cup","slug":"AP-GLF--Solheim Cup Preview, 1st Ld-Writethru","headline":"US, Europe vie for underdog status ahead of Solheim Cup","description":null,"body":"<p>ST. LEON-ROT, Germany (AP)  Going into the Solheim Cup, each team seems to be fighting for the status of underdog.<\/p><p>The Europeans and Americans have both been trying to dampen expectations before the tournament gets underway Friday.<\/p><p>It's the biggest prize in women's team golf and the U.S. can point out that Europe is playing at home and going for three in a row, having captured back-to-back titles for the first time in 2013.<\/p><p>But Europe team captain Carin Koch insists the past will have no bearing on this weekend's competition at the St. Leon-Rot Golf Club near Heidelberg in Germany, and she pointed to the strength of the American team based on the rankings.<\/p><p>''They're so much higher-ranked than we are,'' Koch said. ''This is Solheim Cup 2015 and we start from scratch.''<\/p><p>Veteran Scottish player Catriona Matthew agreed.<\/p><p>''World ranking-wise, their average would certainly be a lot higher than ours. They're going to go in here as favorites,'' said the 46-year-old Matthew, who will be making her eighth Solheim Cup appearance.<\/p><p>Ten of the American players are in the top 40, while Europe have three, but Team USA's Angela Stanford believes the Europeans' point is moot.<\/p><p>''People say, `on paper.' Well, paper doesn't play,'' the 35th-ranked Stanford said. ''When you get out on the course it's golf and it's match play, and absolutely anything can happen. And you can't put on paper somebody's heart. It's hard to say (whether) there's a favorite or not.''<\/p><p>Morgan Pressel and Paula Creamer will lead the American challenge in Friday's opening foursomes, where they will face Sweden's Anna Nordqvist and Norway's Suzann Pettersen, who also opened for Europe in 2013.<\/p><p>''I just wanted a strong team to go out first,'' Koch said about starting with Europe's highest ranked players. ''They played together before and they like to play together. They're both in very good form.''<\/p><p>Michelle Wie and Brittany Lincicome will play English duo Charley Hull and Melissa Reid in the second match, Cristie Kerr and Lexi Thompson meet Karine Icher of France and Azahara Munoz of Spain in the third, and Stacey Lewis and Lizette Salas face Matthew and home favorite Sandra Gal in the fourth.<\/p><p>''My team is ready to go. I think they were ready to go on Monday but we had to wait a little bit,'' U.S. captain Juli Inkster said.<\/p><p>Both teams feature a mixture of youth and experience. Alison Lee, who played her way onto the U.S. team as an LPGA rookie this season, is the only newcomer on either team.<\/p><p>Inkster expected to name Lee in the first morning foursome but the 20-year-old was taken ill with a stomach bug.<\/p><p>''They gave her an IV of fluid today but we'll just see how it goes,'' Inkster said Thursday. ''She going to try and make the opening ceremonies.''<\/p><p>Inkster had picked Creamer and Brittany Lang to join the automatically qualified Lee, Stanford, Lewis, Thompson, Kerr, Wie, Salas, Lincicome, Morgan Pressel and Gerina Piller.<\/p><p>The U.S. captain said it was a ''no-brainer'' for her to send Creamer out to start.<\/p><p>''I watched her practice for three days. She's hitting it great,'' seven-time major winner Inkster said. ''She's excited. I wanted to get her out there and get her feet wet, so to speak. I have all the confidence in the world in her.''<\/p><p>Lincicome, Kerr, Thompson, Pettersen and Nordqvist all have LPGA Tour victories this season.<\/p><p>Wie, who is 6-5-1 in three previous appearances at Solheim, has overcome a frustrating season hampered by injuries, but she appears to have put the problems behind her. She tied for 16th last week in France at the Evian Championship, her best finish since returning from a left ankle injury. For a time, it wasn't looking good.<\/p><p>''There are some conversations when I talked to Juli, honestly I told her I don't know if I could play or not. But the past month, it really has been night and day. I played last week with no pain, knock on wood. And this week, too,'' Wie said on Wednesday. ''I feel great. I feel really good this week. I'm excited to be here. I'm just ecstatic to be here.''<\/p><p>Koch brought Caroline Hedwall of Sweden, Caroline Masson of Germany, Matthew and Icher back to the European team with her four picks. They all played in Colorado in 2013, when Hedwall became the first player to win five out of five matches. She retained the cup for Europe by winning the 14th point.<\/p><p>''For the last year I've been hitting the ball really well but I just haven't putted that well. It kind of was the same situation when I came into the Solheim in 2013 - I didn't make many putts and all of sudden it works. I'm kind of hoping for some magic this week, too,'' said the 26-year-old Swede. Hedwall was also on the winning team in 2011.<\/p><p>Gwladys Nocera of France, who qualified from the Ladies European Tour points list, and Carlota Ciganda of Spain, who claimed her spot through her world ranking, complete the European lineup.<\/p><p>The U.S. leads the series 8-5 overall. The 2017 matches will be played at Des Moines Golf and Country Club in Iowa.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":[],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-17 14:18:31","updated_date":"2015-09-17 14:24:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150917102343029738808","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/17\/ap-glf-solheim-cup-preview"}