{"old_nid":"10218161","title":"Europeans defend controversial call in Solheim Cup defeat","short_headline":"Europeans defend controversial call in Solheim Cup defeat","page_title":"Europeans defend controversial call in Solheim Cup defeat","slug":"AP-GLF--Solheim Cup-Disputed Call","headline":"Europeans defend controversial call in Solheim Cup defeat","description":null,"body":"<p>ST. LEON-ROT, Germany (AP)  Despite making the call that ultimately proved the turning point for the Americans' memorable victory in the Solheim Cup, Suzann Pettersen feels she did the right thing.<\/p><p>It was the Norwegian who demanded American rookie Alison Lee be penalized at the 17th hole of their morning fourball match for picking the ball up when she thought the putt had been conceded. The Americans were furious, and used that anger to engineer the biggest comeback in Solheim history, coming from four points down in the singles to clinch the victory.<\/p><p>Pettersen, though, said she was simply playing by the rules and doing her best for her team. She would ''totally'' do it again.<\/p><p>''It was very clear from Charley (Hull) and me that we wanted to see the putt at the time of play,'' the Norwegian said. ''I mean, we are all trying to win, to play golf. I totally respect the Americans. We totally respect the game.''<\/p><p>The controversy came after Lee's birdie putt had stopped less than two feet from the hole, and the Americans thought the European team conceded when Hull started walking away. However, Hull said she had not been walking off the green as Lee thought but had gone over to consult with Pettersen.<\/p><p>''I was walking over to Suzann to discuss whether or not to give the putt, and then I turn around and she picks it up,'' Hull said. ''And, you know, it went by and that's what happened. And everyone - a few people are saying that I was walking off the green. If they watch it again, I was walking to Suzann.''<\/p><p>Had the putt been conceded, the hole would have been halved and left the match all-square with one hole to play. Instead, Europe was awarded the hole, and went on to win the match.<\/p><p>''To me it looked good. I mean, it was a really short putt, easy putt,'' Lee said. ''And at the same time Charley was walking off the green and Suzann was already off the green so there was no doubt in my mind that that putt was good. ... I didn't even think twice about it. So I just picked it up.''<\/p><p>The incident left both Lee and Hull in tears afterward.<\/p><p>''She picked it up and I felt really bad because of what happened,'' the 19-year-old Hull said. ''It was spur of the moment and I was just upset. I felt sorry for her. But at the end of the day, rules are rules.''<\/p><p>The point helped put Europe up 10-6 going into the singles, but the Americans stormed back to win 14  1\/2 to 13  1\/2. As far as Julie Inkster was concerned, the controversy over Lee's putt was what sparked the American comeback.<\/p><p>''I don't know if my team needed to be fired up anymore, but they were real fired up,'' Inkster said.<\/p><p>Lee, who recovered with a 3 and 1 win over Gwladys Nocera of France, also said the team rallied together after the incident.<\/p><p>''Definitely after everything that happened, it definitely fired us all up to go and pretty much kill it, kill it this afternoon,'' Lee said.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10218146","10218151","10218156"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-20 17:21:49","updated_date":"2015-09-20 17:30:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150920172126940548708","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/20\/ap-glf-solheim-cup-disputed-call"}