{"old_nid":"10084341","title":"No changes to Presidents Cup teams","short_headline":"No changes to Presidents Cup teams","page_title":"No changes to Presidents Cup teams","slug":"AP-GLF--Presidents Cup","headline":"No changes to Presidents Cup teams","description":null,"body":"<p>NORTON, Mass. (AP)  Chris Kirk made his first U.S. team and the International team will have three new players for the Presidents Cup.<\/p><p>The Deutsche Bank Championship was the final qualifying event for determining 10 automatic spots on both teams. There were a few possibilities going into the final round Monday at the TPC Boston, but ultimately no changes.<\/p><p>The next step is for both captains to announce two wild-card selections on Tuesday. Bill Haas finished 11th in the U.S. standings and is getting most of the attention because his father, Jay, is the American captain.<\/p><p>Any other year, he might seem like a logical choice.<\/p><p>''If it's viewed as a penalty to be his son, then that's unfair,'' Haas said. ''Would I be thought of as a good choice if he wasn't my dad? And if you say, `Yes,' then I don't think he should think differently because I'm his son. ... It would be amazing to be in the team where my dad is the captain. But I would say it would be amazing if I was in the team with Fred Couples. Just to be part of that team would be unbelievable, to have him be the captain. It's just cherry on top and something that we would always share.<\/p><p>''But if it doesn't happen, I totally get it.''<\/p><p>Kirk, who had been out for two months with a hand injury, held down the No. 10 spot. He was assured of making his first team unless Charley Hoffman had won, and Hoffman finished four shots back in third place. The U.S. team was based on FedEx Cup points.<\/p><p>Anirban Lahiri of India, Thongchai Jaidee of Thailand and South Korean-born Danny Lee, who grew up in New Zealand, will be making their Presidents Cup debuts Oct. 8-11 when the matches go to South Korea.<\/p><p>The International team is determined by the world ranking.<\/p><p>Matt Jones of Australia was poised to bump Lee out of the No. 10 spot when he made the turn in the final round of the Deutsche Bank. If he finished alone in third, he would have moved past Lee in the ranking. Jones hit into a hazard on No. 10 and made double bogey, and he made another double bogey on No. 12 to plunge down the leaderboard. That was his last mistake, and he finished in a five-way tie for fourth.<\/p><p>Lee still had to sweat it out. Even though he was ahead of Steven Bowditch in the ranking, the Australian would have passed him in the ranking if Lee finished out of the top 40. Lee made eight bogeys and a double bogey, but managed enough birdies for a 77. He made a 3-foot par putt on the 18th to make the team with one shot to spare.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10083271","10084336"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-07 20:33:54","updated_date":"2015-09-07 20:46:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150907203345630704008","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/07\/ap-glf-presidents-cup"}