{"old_nid":"10075971","title":"ON THE TEE: Stenson tries to repeat role as Mr. September","short_headline":"ON THE TEE: Stenson tries to repeat role as Mr. September","page_title":"ON THE TEE: Stenson tries to repeat role as Mr. September","slug":"AP-GLF--On The Tee","headline":"ON THE TEE: Stenson tries to repeat role as Mr. September","description":null,"body":"<p>NORTON, Mass. (AP)  Henrik Stenson wants to be at his best for tournaments that offer the ''biggest prizes.'' He would prefer the majors, though that didn't work out well for him this year. The FedEx Cup is a small consolation, but only in history, not prize money.<\/p><p>The $10 million bonus is still a long way off. It won't be decided for three more weeks at the Tour Championship, and even though Jordan Spieth has missed his last two cuts, he still has just as good a chance as anyone.<\/p><p>Even so, Stenson is in position to take another shot.<\/p><p>The first step was to make sure he returned to East Lake for the Tour Championship, which he hasn't played since he won two years ago to claim golf's biggest prize. He locked up a spot with a runner-up finish at The Barclays last week that moved him to No. 2 in the FedEx Cup.<\/p><p>Monday at the Deutsche Bank Championship would be a big step, assuring the Swede of being among the top five.<\/p><p>Stenson blistered the front nine of the TPC Boston and played bogey-free on Sunday for a 6-under 65, giving him a one-shot lead over Rickie Fowler (67) going into the Labor Day finish of the second FedEx Cup playoff event.<\/p><p>Here's what is at stake on Monday:<\/p><p>STENSON REPEAT?: The last time Stenson won the Deutsche Bank Championship in 2013, he was considered one of the hottest players in golf. He was runner-up at the British Open and tied for third in the PGA Championship, so he was trending.<\/p><p>That might still be the case, even though the majors were a bust for him. He finished at least 10 shots out of the lead in each of them.<\/p><p>Even so, it's setting up nicely for Stenson. He's hitting it crisp. The TPC Boston typically favors big hitters. And the rotation in the playoffs is the same as two years ago by going Plainfield, TPC Boston, Conway Farms and East Lake.<\/p><p>''I should win this every second year,'' he said.<\/p><p>LITTLE RICKIE: Fowler spoke a year ago about being a chief challenger to Rory McIlroy, who at the time had no serious competitor. Now there are three - McIlroy, Jordan Spieth and Jason Day - and Fowler would love to crash the party.<\/p><p>He has won The Players Championship and the Scottish Open. He likes his chances being only one shot behind. If he were to win, does that make it the Big Four?<\/p><p>Not quite. For one thing, Fowler would only move up to No. 5. For another, there are a lot of good players right now.<\/p><p>''There's a lot of guys playing well,'' Fowler said.<\/p><p>THE BIG ONE: Spieth is all but certain to return to No. 1 in the world, even though he hasn't made a cut or even broken par in three weeks. To pass him, Day would have to win, and he's 10 shots behind. McIlroy would have to finish alone in 10th, and he's 15 shots behind.<\/p><p>So it's all about next week. If McIlroy finishes better than 44th, that means he would return to No. 1 by the time the FedEx Cup playoffs resume Sept. 17 in Chicago. And if that happens, McIlroy would be the first player to go to No. 1 three times without playing.<\/p><p>DAY BREAK: Jason Day can use a breather, and it showed. Not only has he played six of the last eight weeks, he won three of them. Then there's the pressure of trying to reach No. 1 for the first time. It all caught up with him on the TPC Boston when the Australian shot a 73. It was his first time over par since a 74 in the final round of the U.S. Open.<\/p><p>PRESIDENTS CUP: Monday is the final day to finishing in the top 10 (point for the Americans, world ranking for the International side) and qualify for the Presidents Cup. Chris Kirk looks to be safe at No. 10 for the U.S. team. Hoffman could have bumped him out with a victory, though a 76 on Saturday shoved him six shots out of the lead and did not help his cause.<\/p><p>The International team is more up in the air. Danny Lee has to avoid a big collapse on Monday and he would have the 10th spot over Steven Bowditch. However, Matt Jones of Australia is lurking. Jones shot a 68 and was tied for third, two shots out of the lead. Jones would lock up a spot if he were to finish second. Even if he finished third, that might be enough, depending on Danny Lee.<\/p><p>MARATHON MAN: The FedEx Cup playoffs are cut to 70 players after Monday. The player to watch is Hunter Mahan, who is No. 91 but in a tie for 11th and poised to crack the top 70 with another good round. Mahan is the only player to have never missed a playoff event.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10073976","10075936","10075941","10075946","10075951","10075956","10075961","10075966"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-07 02:34:05","updated_date":"2015-09-07 02:47:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150907023318722197408","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/07\/ap-glf-tee"}