{"old_nid":"9997191","title":"Canadian Rod Spittle takes 2nd-round lead at Dick's","short_headline":"Canadian Rod Spittle takes 2nd-round lead at Dick's","page_title":"Canadian Rod Spittle takes 2nd-round lead at Dick's","slug":"AP-GLF--Champions Tour, 1st Ld-Writethru","headline":"Canadian Rod Spittle takes 2nd-round lead at Dick's","description":null,"body":"<p>ENDICOTT, N.Y. (AP)  For Canadian Rod Spittle, just playing on the Champions Tour at age 60 is old hat that never gets old. Now, he finds himself in a most unusual place - alone in the lead for the first time heading to Sunday.<\/p><p>Spittle shot a 6-under 66 on Saturday to take a one-shot lead over tour newcomer Scott McCarron (64) and John Huston (68) after the second round of the Dick's Sporting Goods Open. Spittle was at 10-under 134.<\/p><p>Huston, the 2011 champion, is trying to become the first two-time winner in the event that started in 2007.<\/p><p>Jeff Maggert (68), Stephen Ames (64), Ian Woosnam (69) and first-round co-leader Paul Goydos (70) were tied for fourth at 8 under, with Corey Pavin (66) and Willie Wood (69) another shot behind.<\/p><p>Spittle, a star at Ohio State in the late 1970s with Joey Sindelar and John Cook, turned pro at age 49 after working as a corporate insurance executive for 25 years. He won the 2010 AT&T Championship, 106 starts ago.<\/p><p>''I was home being a husband and a dad,'' said Spittle, who wanted to watch his three children grow up instead of traveling and living out of a suitcase. ''We've won all of one time out here. It's very fun to have a chance to win. The reason I still play is I think I can win again.''<\/p><p>Spittle, who had a 68 on the opening round, had four birdies and a bogey on the front nine, barely missing a fifth birdie when his putt at the par-3 seventh hole stopped at the lip and didn't drop. He had two more birdies and another bogey over the first five holes on the back side, then  vaulted into the lead with an eagle at the par-4 No. 16, his chip from 65 yards bouncing twice on the green before hitting the flag and dropping in the hole.<\/p><p>''Folks started jumping up and down, so we guessed right,'' Spittle said with a chuckle. ''I've played very solid this summer, been very consistent the last five or six weeks. We'll see if we can have some more fun tomorrow.''<\/p><p>Right behind was McCarron, playing just his fourth event on the Champions Tour since turning 50 in July. He made up considerable ground on the leaderboard as he chases his first victory and said playing in the final group with Schwab Cup points leader Colin Montgomerie at the Shaw Charity Classic at Calgary, Alberta in early August did wonders for his game.<\/p><p>''It's been a long time,'' said McCarron, who had three PGA Tour victories, the last at the 2001 BellSouth Classic. ''I learned a lot just being in the final group with Colin on Saturday. When you don't get in tournaments on the PGA Tour, you play once a month, once every two months, and you miss every cut by a shot, that's not a lot of fun.<\/p><p>''Being out here, knowing there's no cut, I'm having fun playing golf again,'' said McCarron, who has overcome surgery for a bone spur and torn ligaments in his left thumb in 2012 and right elbow surgery in 2006. ''I'm healthy, I'm happy and I'm in better shape now than I've ever been.''<\/p><p>Montgomerie is not playing for a second straight week because of commitments in Europe, giving Maggert and Bernhard Langer a chance to take over the top spot. Montgomerie has 2,873 points, Maggert 2,707 and Langer 2,604 in what has become a three-way competition with four more events until the Schwab Cup Championship in November.<\/p><p>Langer, who won here last year, plummeted with three bogeys in the last six holes Saturday to finish with his second straight 71 and at 2 under is likely out of contention for a top-10 finish and a chance to gain in the points race.<\/p><p>Maggert isn't<\/p><p>''I need to be a little more aggressive on the front nine tomorrow, make four or five birdies if I can, and set myself up for a good finish,'' said Maggert, who birdied the three par-5s on the front side but also had a pair of bogeys.<\/p><p>A bogey on his final hole after seven birdies put a frown on Pavin's face. Still, he was just three shots behind and playing well.<\/p><p>''Tomorrow, I've got to go out and probably shoot another score like that to have a chance,'' said the 55-year-old Pavin, who has 15 PGA Tour wins but just one on the senior tour, three years ago. ''We'll just see. I'm in a position where I can make a run, hopefully.''<\/p><p>Just like the opening round, conditions on the narrow, tree-lined 6,974-yard En-Joie Golf Club course were ideal, with partly cloudy skies, temperatures around 80, and just the hint of a breeze.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["9997186"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-08-29 19:02:13","updated_date":"2015-08-29 19:12:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150829185630338351008","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/08\/29\/ap-glf-champions-tour-1st-ld-writethru"}