{"old_nid":"10245046","title":"Stenson can win $10 million without winning a tournament","short_headline":"Stenson can win $10 million without winning a tournament","page_title":"Stenson can win $10 million without winning a tournament","slug":"AP-GLF--Golf Notes","headline":"Stenson can win $10 million without winning a tournament","description":null,"body":"<p>ATLANTA (AP)  The last five winners of the FedEx Cup also won the Tour Championship. Vijay Singh in 2008 and Tiger Woods in 2009 are the only FedEx Cup champions who didn't win at East Lake.<\/p><p>Henrik Stenson is in position to make his own brand of history this week - winning the FedEx Cup without winning a PGA Tour event all year.<\/p><p>The Swede started at No. 41, soared up to No. 4 with a runner-up finish at The Barclays, had another runner-up finish at the Deutsche Bank Championship and has held that position going into the final event. He could finish in a tie for third and have a mathematical chance of winning the $10 million bonus.<\/p><p>''I'm just going to try my hardest this week,'' Stenson said. ''But if I finish second or third and win the overall, you won't see me leaving here crying, I know that much. Not out of sadness, anyway.''<\/p><p>Stenson would much rather win the Tour Championship and claim golf's biggest bonus, as he did two years ago at East Lake.<\/p><p>''I still have one more chance and it shouldn't be too hard to wipe the floor with these guys, right?'' Stenson said, shifting into sarcasm mode. ''There's no one that's playing great and is sky-high on confidence, and no one with a bunch of majors and no one hits it 330 off the tee. So it shouldn't be that hard.''<\/p><p>Even so, a FedEx Cup title without having won anything on the PGA Tour would make the FedEx Cup an easy target for its points system, or how the PGA Tour has chosen to reset the points at the Tour Championship to give everyone a chance.<\/p><p>Stenson compared it with the world ranking. The year Lee Westwood reached No. 1 in the world, he had won just one tournament in 2010 and had not won in more than four months when he got to the top. It was a product of several good results, including a pair of runner-up finishes in the majors.<\/p><p>It's not like the year has been a total loss. Stenson twice had the 54-hole lead this year, at Bay Hill and the TPC Boston, and didn't win.<\/p><p>This is nothing new for Stenson. He was in position to win the Race to Dubai two years ago without having won on the European Tour. But then he won the finale in Dubai and ''kind of finished those conversations.''<\/p><p>---<\/p><p>REVOLVING DOOR: The No. 1 ranking hasn't been this unsettled since Tiger Woods, Greg Norman and Ernie were swapping the top spot in 1997.<\/p><p>Jason Day going to No. 1 with his victory at the BMW Championship meant the No. 1 ranking changed five times in five weeks - Jordan Spieth, Rory McIlroy, Spieth, McIlroy and Day. That tied an Official World Golf Ranking record set from June 8 to July 6 in 1997 when it went Norman, Woods, Els, Norman and Woods.<\/p><p>Woods then held the No. 1 spot for the next two months.<\/p><p>For the No. 1 spot to change for a sixth straight week, McIlroy or Spieth would have to win the Tour Championship. Day can secure No. 1 by finishing alone in fifth or better.<\/p><p>---<\/p><p>TALE OF THE TAPE: Henrik Stenson and Bubba Watson are among those are waiting to see if Jason Day can win the Tour Championship before deciding whether Day or Jordan Spieth gets their votes for PGA Tour player of the year.<\/p><p>Here's where they stand going into the final event of the year:<\/p><p>- Spieth won the Masters and U.S. Open. Day won the PGA Championship.<\/p><p>- Day has five victories. Spieth has four.<\/p><p>- Spieth has wrapped up the money title with $10,545,465. Day has earned $9,174,805.<\/p><p>- Spieth has a 68.99 adjusted scoring average in the race to win the Vardon Trophy. Day is at 69.13.<\/p><p>- Spieth has accumulated 532.31 world ranking points this year, compared with 444.85 for Day. That might be a slight edge for Day, however, because he has played in four fewer events. Spieth has averaged 23.14 points for event, while Day has average, 23.41 points.<\/p><p>---<\/p><p>BUBBA'S MISSION: The good news for Bubba Watson is that he's among the top five in the FedEx Cup at the Tour Championship and has a clear shot at the $10 million bonus. The bad news is still hasn't quite figured out East Lake.<\/p><p>In five previous appearances at the Tour Championship, his best was a tie for fifth in 2012 and twice he has been outside the top 20.<\/p><p>''It's just about getting comfortable and getting used to a situation or a place,'' Watson said. ''It's a learning process.''<\/p><p>Watson said his wife reminded him that he used to not like Doral until strong finishes in recent years, so there's hope. Then again, he has no choice. The Tour Championship has been at East Lake every year since 2004.<\/p><p>''This is a tournament I can't miss and I don't want to miss,'' he said. ''I want to be here every year. I would rather struggle here than not be here. But that's the process of a golfer. You don't want to be really good at your home course, you want to be good at every golf course. So I'm trying to figure that out as I go and I haven't figured that out but once. I finished fifth one time. I am guessing that has to do with putting. I am guessing I putted pretty good that week.''<\/p><p>---<\/p><p>EARLY START: Rickie Fowler still has plenty of golf on his schedule the rest of the year, including plans for an additional PGA Tour event.<\/p><p>After the Presidents Cup in South Korea, Fowler said he would play the Las Vegas event before heading back to Asia for the HSBC Champions in Shanghai. Las Vegas is the first PGA Tour event that Fowler played as a pro in 2009. He tied for seventh.<\/p><p>Fowler said having played only one time last fall, he felt he had fallen too far behind when he played his next PGA Tour event three months later in the Phoenix Open.<\/p><p>It doesn't hurt that swing coach Butch Harmon is located in Las Vegas.<\/p><p>''I've enjoyed playing there when I go,'' Fowler said. ''And it's one more event in the fall schedule.''<\/p><p>---<\/p><p>DIVOTS: Jordan Spieth needs a two-way tie for fourth or better at the Tour Championship to set the single-season earnings record on the PGA Tour. ... With two events remaining in the Web.com Tour Finals, a couple of PGA Tour players are on the bubble for earning their cards. Former U.S. Open champion Lucas Glover is at No. 24, with Jonathan Byrd and John Merrick in a tie for 25th. The Nationwide Children's Hospital Championship is this week on the Scarlett Course at Ohio State University, followed by the Web.com Tour Championship at the TPC Sawgrass Valley course. ... Eight players are in the Tour Championship for the first time - Daniel Berger, Kevin Kisner, Danny Lee, J.B. Holmes, Steven Bowditch, Brooks Koepka, Sang-moon Bae and Harris English. Kisner, English and Berger made it despite not winning this year.<\/p><p>---<\/p><p>STAT OF THE WEEK: The PGA Tour had 102 players who earned more than $1 million this year.<\/p><p>---<\/p><p>FINAL WORD: ''To take a 12-year-old kid from nothing and turn him into the best golfer in the world is a pretty nice achievement.'' - Jason Day on his longtime coach and caddie Colin Swatton.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10243076","10245031","10245036","10245041"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-22 18:11:12","updated_date":"2015-09-22 18:27:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150922181050139622808","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/22\/ap-glf-golf-notes"}