{"old_nid":"10243086","title":"Golf's player of year vote could be referendum on FedEx Cup","short_headline":"Golf's player of year vote could be referendum on FedEx Cup","page_title":"Golf's player of year vote could be referendum on FedEx Cup","slug":"AP-GLF--On The Fringe-092215","headline":"Golf's player of year vote could be referendum on FedEx Cup","description":null,"body":"<p>ATLANTA (AP)  PGA Tour players might be voting on more than just their player of the year.<\/p><p>Depending on how the Tour Championship unfolds this week at East Lake, the vote could also be a referendum on how they view the FedEx Cup.<\/p><p>No one thought this would even be a contest a month ago when the most significant part of the golf schedule ended at the PGA Championship. Even with Jason Day finally breaking through for his first major title, this year was all about Jordan Spieth.<\/p><p>The 22-year-old Texan won the Masters and U.S. Open among his four PGA Tour titles. He missed the British Open playoff by one shot and played in the final group at Whistling Straits, where he was unable to make up a two-shot deficit against Day at the PGA Championship.<\/p><p>The only debate was where Spieth's season ranked in PGA Tour history.<\/p><p>But that was the last great moment for Spieth. And it was just the start for the 27-year-old Australian.<\/p><p>Day began to overpower players and courses. He set a major championship record to par (20 under) at Whistling Straits. He followed that with a six-shot victory at The Barclays, and then opened with rounds of 63-61 to blow away the field at Conway Farms for a six-shot victory in the BMW Championship.<\/p><p>That was his fifth win of the year - one more than Spieth - and Day went to No. 1 in the world ranking.<\/p><p>''I still think it's him,'' Day said Sunday. ''But I'm hoping that I can go and win next week and get people talking about it a lot more.''<\/p><p>The ballots will be emailed to PGA Tour players on Sunday night after the Tour Championship following what amounts to the last campaign stop at East Lake.<\/p><p>A victory for Day would give him six wins and a major. To put that into context, only three other players over the last 40 years have won six times in one season on the PGA Tour - Tom Watson (1980), Nick Price (1994) and Tiger Woods (six times).<\/p><p>If he were to win, then it really would be a tale of two seasons.<\/p><p>Spieth dominated the important part of the year. Day thrived during the bonus time of the year.<\/p><p>The FedEx Cup is not hit-and-giggle. It starts with the top 125 players on the PGA Tour and, with the value of points quadrupled, whittles the field to the top 30 at the Tour Championship who all have a mathematical shot at the $10 million bonus. A vote for Day might indicate how much importance players put on the tour's postseason.<\/p><p>The whole debate starts with the assumption Day will win the Tour Championship, and at the rate he's been going, that's not a stretch.<\/p><p>Rickie Fowler said his main criteria would be victories, though not just any title. ''Majors. Majors are big,'' he said. ''With what Jordan's done this year, it's pretty amazing. Jason is making his late charge, so he's not making it any easier on the voting side of it.''<\/p><p>Henrik Stenson won't decide until after the Tour Championship, although the Swede did make one prediction that was fairly safe.<\/p><p>''Someone with the first letter of `J' will win it,'' he said.<\/p><p>More than just the 30 players gathered at East Lake are voting. Ballots go to 200-plus members, some of whom didn't even keep their cards, much less find their way to New Jersey for the start of the FedEx Cup. Do they look at how Day closed the gap during the most lucrative time of the year - $8.5 million purses against some of the strongest fields of the year in a chase for a $10 million bonus - or what Spieth did during the four events that are the fabric of golf history?<\/p><p>Spieth was only the third player to capture the first two legs of the Grand Slam, and he was tied for the lead through 70 holes at St. Andrews until a bogey on No. 17. Only three other players in 58 years of stroke play at the PGA Championship finished more under par than Spieth at Whistling Straits. One of them happened to be Day.<\/p><p>Spieth already has clinched the money title even if Day were to win the Tour Championship. And while Day is not far behind, Spieth still has the lead in the Vardon Trophy for the lowest adjusted scoring average.<\/p><p>History would seem to favor Spieth.<\/p><p>Since the Jack Nicklaus Award for the player of the year began in 1990, only one player won two majors in the same season without getting the award. That was Nick Faldo in 1990 and he wasn't on the ballot because he wasn't a PGA Tour member.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10243056","10243061","10243066","10243071","10243076","10243081"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-22 16:13:16","updated_date":"2015-09-22 16:20:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150922155806412574808","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/22\/ap-glf-fringe-092215"}