{"old_nid":"10223381","title":"Pettersen apologizes for controversial call in Solheim Cup","short_headline":"Pettersen apologizes for controversial call in Solheim Cup","page_title":"Pettersen apologizes for controversial call in Solheim Cup","slug":"AP-GLF--Solheim Cup-Pettersen, 1st Ld-Writethru","headline":"Pettersen apologizes for controversial call in Solheim Cup","description":null,"body":"<p>ST. LEON-ROT, Germany (AP)  Suzann Pettersen apologized Monday for making the controversial call that left United States players fuming before their memorable victory in the Solheim Cup.<\/p><p>Pettersen had demanded American rookie Alison Lee be penalized at the 17th hole of their morning fourball match for picking the ball up when she thought the putt was conceded.<\/p><p>The Norwegian, who initially said Sunday she did the right thing and would ''totally'' do it again, took to social media to say she ''never felt more gutted and truly sad about what went down.''<\/p><p>''I am so sorry for not thinking about the bigger picture in the heat of the battle and competition. I was trying my hardest for my team and put the single match and the point that could be earned ahead of sportsmanship and the game of golf itself! I feel like I let my team down and I am sorry,'' Pettersen said.<\/p><p>The 34-year-old golfer paid tribute to U.S. captain Juli Inkster, ''a great leader'' to whom she said she ''always looked up to and respect so much.''<\/p><p>''Knowing I need to make things `right,' I had a face to face chat with her before leaving Germany this morning to tell her in person how I really feel about all of this. I wanted her also to know that I am sorry,'' Pettersen wrote.<\/p><p>''I hope in time the U.S. team will forgive me and know that I have learned a valuable lesson about what is truly important in this great game of golf which has given me so much in my life.''<\/p><p>The controversy arose after Lee's birdie putt stopped less than two feet from the hole and she thought the European team conceded when Pettersen's partner Charley Hull started walking away. However, Hull said she had not been walking off the green but had gone over to consult with Pettersen to see whether they should concede or not. But Lee had already scooped up the ball.<\/p><p>Had the putt been conceded, the hole would have been halved and left the match all-square with one hole to play. Instead, Europe was awarded the hole, and went on to win the match.<\/p><p>That point helped put Europe up 10-6 going into the singles, but the Americans stormed back to win 14  1\/2 to 13  1\/2.<\/p><p>Lee, who recovered with a 3 and 1 win over Gwladys Nocera of France, said the team rallied together after the incident.<\/p><p>''Definitely after everything that happened, it definitely fired us all up to go and pretty much kill it, kill it this afternoon,'' Lee said.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10218156","10223371","10223376"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-21 08:31:42","updated_date":"2015-09-21 08:41:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150921080139805934008","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/21\/ap-glf-solheim-cup-pettersen"}