{"old_nid":"10070816","title":"Slattery holds off Goya to win Russian Open by 1 shot","short_headline":"Slattery holds off Goya to win Russian Open by 1 shot","page_title":"Slattery holds off Goya to win Russian Open by 1 shot","slug":"AP-GLF--Russian Open, 1st Ld-Writethru","headline":"Slattery holds off Goya to win Russian Open by 1 shot","description":null,"body":"<p>MOSCOW (AP)  Lee Slattery bounced back from an erratic start to shoot a 2-under 69 Sunday that was enough for a one-shot victory at the Russian Open.<\/p><p>The Englishman entered the final round with the lead but two bogeys on the front nine left him temporarily two shots behind Argentina's Estanislao Goya. However, Slattery birdied three of his last eight holes, including a chip in from the rough on the 17th, while Goya bogeyed the 13th and 15th.<\/p><p>''That chip in was massive,'' said Slattery, who narrowly missed out on a European Tour card for this season. ''Having to ask a lot of promoters for invites, it's been a difficult year. I forgot what it was like to write letters. I've written a lot this year and it's just nice to be able to finish the year off like this with a win.''<\/p><p>Slattery finished with a 15-under total of 269 as he secured his second career European Tour win, and first since 2011.<\/p><p>Goya was second after a 68, with defending champion David Horsey of England (68) another shot back in third following a bogey-free round. Northern Ireland's Michael Hoey was one of four players to share fourth place on 12 under.<\/p><p>South African Jake Roos set a course record with an eight-under 63, hauling him up the leaderboard from 34th overnight to joint eighth. In damp conditions at the Skolkovo Golf Club, the start of play was delayed by two hours due to fog.<\/p><p>Golf has become increasingly popular in recent years with the Russian elite, and the tournament attracted a small but well-heeled crowd, some with bodyguards in tow.<\/p><p>Andrei Pavlov pleased the spectators by becoming the first Russian ever to make the cut at a European Tour event, but he could not keep up the same form for the final two rounds, finishing 71st on 13 over.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10062871"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-06 10:52:02","updated_date":"2015-09-06 11:01:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150906085657983627108","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/06\/ap-glf-russian-open"}