{"old_nid":"10194551","title":"Matches underway at Solheim Cup in Germany","short_headline":"Matches underway at Solheim Cup in Germany","page_title":"Matches underway at Solheim Cup in Germany","slug":"AP-GLF--Solheim Cup, 1st Ld-Writethru","headline":"Matches underway at Solheim Cup in Germany","description":null,"body":"<p>ST. LEON-ROT, Germany (AP)  Europe and the United States were tied at 2-2 at the Solheim Cup following Friday morning's alternate-shot foursome matches at the St. Leon-Rot Golf Club in Germany.<\/p><p>Morgan Pressel and Paula Creamer defeated Europe's top-ranked players, Anna Nordqvist of Sweden and Suzann Pettersen of Norway, 3 and 2 to secure the first point for the visitors.<\/p><p>But English duo Charley Hull and Melissa Reid won 2 and 1 against Michelle Wie and Brittany Lincicome, and home favorite Sandra Gal teamed up with Catriona Matthew to put Europe 2-1 up with an impressive 3 and 2 win over Stacey Lewis and Lizette Salas.<\/p><p>Cristie Kerr and Lexi Thompson pulled the Americans level with a 2 and 1 victory over Karine Icher of France and Azahara Munoz of Spain.<\/p><p>In the afternoon's best-ball fourball matches, Pressel and Creamer were to play Nordqvist and Swedish compatriot Caroline Hedwall, while American rookie Alison Lee recovered from a stomach bug to take her place alongside Angela Stanford against Gwladys Nocera of France and Hull.<\/p><p>Kerr and Thompson were to play Reid and Spain's Carlota Ciganda, with Gerina Piller and Brittany Lang taking on German duo Gal and Caroline Masson.<\/p><p>Europe is going for three titles in a row in the competition, while the U.S. is hoping to win its first since 2009.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10194861","10194866","10194871","10194956"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-18 07:11:27","updated_date":"2015-09-18 07:26:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150918033420889249608","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/18\/ap-glf-solheim-cup"}