{"old_nid":"10032226","title":"Bubble time for players trying to make Presidents Cup","short_headline":"Bubble time for players trying to make Presidents Cup","page_title":"Bubble time for players trying to make Presidents Cup","slug":"AP-GLF--Presidents Cup","headline":"Bubble time for players trying to make Presidents Cup","description":null,"body":"<p>NORTON, Mass. (AP)  Bill Haas is grinding harder than ever in the FedEx Cup playoffs, only the immediate goal has nothing to do with a $10 million bonus.<\/p><p>He wants a chance to play for no money at all.<\/p><p>Haas is No. 11 in the Presidents Cup standings. The Deutsche Bank Championship, which starts Friday, is the final event for the top 10 players to earn automatic spots on the U.S. team for the Oct. 8-11 matches in South Korea.<\/p><p>Haas, who has played on the last two Presidents Cup teams, already gets enough attention for being on the bubble. It gets even more acute because his father, Jay Haas, is the U.S. captain for the first time.<\/p><p>So he wasn't surprised to be stopped on his way to the putting green Wednesday at the TPC Boston. Nor was he bothered when he was asked Sunday at The Barclays, after closing with a 74 to fall down the leaderboard, whether he was pressing too much because his father is the captain.<\/p><p>His round went south on the 12th hole last week when he tried to play out of a hazard in a bid to make birdie, and he wound up making triple bogey. Haas doesn't feel any more pressure trying to make the Presidents Cup team as he did trying to make the Ryder Cup team a year ago, or trying to win a tournament.<\/p><p>It's all part of golf.<\/p><p>''If a 400-pound bear chases you, are you more scared than if a 200-pound bear is chasing you?'' he said. ''You're still scared and still running fast as (you can). It stinks that I'm close this year. Then again, if I'm 25th, you're not asking me the question. So it's good that you're asking the question. It's a good problem.''<\/p><p>Jordan Spieth has been a lock for the team sometime after he collected his two majors this year. He is followed in the standings by Bubba Watson, Jimmy Walker, British Open champion Zach Johnson, Jim Furyk, Dustin Johnson, Patrick Reed, Rickie Fowler and Matt Kuchar.<\/p><p>Chris Kirk is at No. 10, coming off a hand injury that forced him to miss two majors and a World Golf Championship. He returned to competition last week and missed the cut, and he is the defending champion at the Deutsche Bank.<\/p><p>''I really, really would love to make the team,'' Kirk said. ''But it's not like I can go out and hit balls on the range this afternoon, like I'm going to hit an extra bucket of balls so I can make The Presidents Cup team. You just and play and try to play the best you can, and see how it works out.''<\/p><p>Haas would need at least fifth place alone this week to move past Kirk, and the others behind him would have to play even better, such as Houston Open winner J.B. Holmes, Billy Horschel and Brandt Snedeker. Horschel has had only two top 10s since he won the FedEx Cup last year.<\/p><p>Jay Haas will get two captain's picks, and the players outside the top 10 all seem to know the drill. It's best to not have it come down to being a pick.<\/p><p>That includes the captain's son.<\/p><p>Jay Haas was an assistant captain in 2011 when his son was picked. Then again, Bill Haas had just won the Tour Championship and the FedEx Cup.<\/p><p>''I can't imagine me trying any less if he wasn't the captain,'' Bill Haas said. ''I'm going to do my best. A lot of times, your best isn't good enough, and sometimes it is. He wants me to make the team like he wanted me to make the Ryder Cup team last year. But he's also going to choose the player he thinks is best for the team. I don't think he's going to tell me, `Bill, you weren't good enough.' He's going to say, `This guy was playing really well and I had to pick him.'<\/p><p>''There won't be a conversation we're going to have that's like, `Why didn't you pick me, Dad?' I'm going to understand why he doesn't. And I'll understand why he does.''<\/p><p>Brooks Koepka gets a lot of attention as a potential pick, though he missed the cut for only the second time this year at The Barclays. Koepka didn't see that as overly detrimental because it was his seventh in eight weeks. He found a quiet spot on the beach near Rhode Island to relax for a few days, and then played a practice round Wednesday with Davis Love III, an assistant captain for the Presidents Cup.<\/p><p>Koepka has never been on any bubble, ''except maybe in school when I was trying to go from a C to a B.'' What will it take to get him on his first U.S. team?<\/p><p>''Win,'' he said. ''It's pretty simple.''<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":[],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-02 14:06:13","updated_date":"2015-09-02 14:19:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150902140523075950808","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/02\/ap-glf-presidents-cup"}