{"old_nid":"10044201","title":"Battle of the new 'Big 3' at Deutsche Bank","short_headline":"Battle of the new 'Big 3' at Deutsche Bank","page_title":"Battle of the new 'Big 3' at Deutsche Bank","slug":"AP-GLF--Deutsche Bank","headline":"Battle of the new 'Big 3' at Deutsche Bank","description":null,"body":"<p>NORTON, Mass. (AP)  Based more on current form than a mathematical formula, Jordan Spieth believes Jason Day is the No. 1 player in golf.<\/p><p>Day is coming off a six-shot victory in the opening FedEx Cup playoff event. In his previous tournament, Day became the first player to finish 20-under par in a major when he won the PGA Championship. He has won three of his past four tournaments.<\/p><p>''He's playing the best of anybody right now,'' Spieth said Thursday at the Deutsche Bank Championship. ''Until somebody dethrones him - hopefully me this week - he's still that guy to beat right now.''<\/p><p>Day has dreamed of being No. 1 in the world since before he even joined the PGA Tour. But he's interested in the ranking, not an opinion. That's why he points to Rory McIlroy and Spieth, the two guys ahead of him in the two-year ranking system.<\/p><p>''I can't say I'm the No. 1 player in the world right now,'' Day said. ''I just can't do it. There's two guys ahead of me that have played phenomenal golf over the last two years. I've played good golf, but I really played fantastic golf just in the last seven weeks.''<\/p><p>As for McIlroy?<\/p><p>He went back to No. 1 even though he didn't play last week. At least not in New Jersey.<\/p><p>''The world ranking people must have saw how I was playing at home,'' McIlroy said with a laugh.<\/p><p>Golf hasn't seen a three-man race for No. 1 at such a high level of play in more than 10 years. McIlroy, Spieth and Day each have a chance to get to No. 1 at the Deutsche Bank Championship, which starts Friday. Day would have to win. It's so close between No. 1 and No. 2 that Spieth has the easier road to the top this week.<\/p><p>Four players had a shot at No. 1 going into The Players Championship, though that was a matter of who got there by default.<\/p><p>This is different.<\/p><p>All three have an average of at least 10.99 points in the ranking. The previous time three players all had a double-digit average with No. 1 up for grabs was Vijay Singh, Tiger Woods and Ernie Els going into the 2005 Masters.<\/p><p>Woods was the youngest of that version of the ''Big Three.'' He was 29.<\/p><p>Day is the oldest in this group. He's 27.<\/p><p>The first showdown starts Friday on the TPC Boston, even if none of them are looking at it that way.<\/p><p>''I'm not focused on what either one is doing on the leaderboard unless they're in the lead,'' Spieth said. ''And then if they're in the lead, how do I get up there and surpass them? But honestly, it has no effect off the course. We're working hard just to try to win the tournament. There's 100 guys this week that are fully capable of having four good days and winning this event. And hopefully, that can be.''<\/p><p>Only 98 of the top 100 who advanced to the second playoff event are at the TPC Boston. Sergio Garcia isn't playing for the second straight week (he fell from No. 31 to No. 43) and Wil Wilcox withdrew with an injury (his season is over).<\/p><p>The newest version of the Big Three were all at the course on Tuesday to get in some extra work.<\/p><p>Day would seem to have the least to work on given his play in recent weeks. He is battling a cold this week, though he was grinding away and feeling better about it. He believes that it's getting through practice on the tough days that set him up for winning because he knows he has put in the work.<\/p><p>McIlroy took the past two weeks off after missing two months with an ankle injury, though he was playing last week in Florida.<\/p><p>Spieth is coming off a missed cut. He cut short his time in New York to meet coach Cameron McCormick at the TPC Boston. He was tempted to go home to Dallas, but realized he could practice longer or faster greens in Boston than in Dallas.<\/p><p>''Got a lot of good work in,'' Spieth said. ''There wasn't much to fix. It was more what I was making up in my head. I was creating bigger problems than there really was, which I figured was the case. It's just nice to have him (McCormick) behind me letting me know that it looks good, you can produce all the ball flights, you can win with what you're doing right now. It hasn't changed.''<\/p><p>The top 70 in the FedEx Cup advance to the third playoff event in two weeks north of Chicago. This week also is the final event to qualify for the Presidents Cup team.<\/p><p>Two years ago, Spieth closed with a 62 to get Fred Couples' attention as a captain's pick. Now he is No. 1 on the American team. And if enough goes his way this week, Spieth could go back to No. 1 in the world.<\/p><p>At least for the moment.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10006556","10006586","10044196"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-03 14:15:47","updated_date":"2015-09-03 14:20:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150903141509370498308","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/03\/ap-glf-deutsche-bank"}