{"old_nid":"10127191","title":"US captain wants Walker Cup players to have 'fun'","short_headline":"US captain wants Walker Cup players to have 'fun'","page_title":"US captain wants Walker Cup players to have 'fun'","slug":"AP-GLF--Walker Cup Preview","headline":"US captain wants Walker Cup players to have 'fun'","description":null,"body":"<p>LYTHAM ST ANNES, England (AP)  United States captain John `Spider' Miller wants his team to have ''fun'' against Britain and Ireland in the 45th Walker Cup when the biennial amateur event starts Saturday.<\/p><p>Playing on the Lancashire links at Royal Lytham & St Annes Golf Club in north west England, the Americans are seeking to retain the trophy they won 17-9 at the National Golf Links of America in New York two years ago.<\/p><p>''I want it to be fun for them,'' said Miller, himself a Walker Cup player in 1999. ''To make it an experience that they will never forget.''<\/p><p>Welshman Nigel Edwards, the Britain and Ireland captain for the third successive time, will be bidding to regain the trophy he won on his first occasion at the helm at Royal Aberdeen four years ago.<\/p><p>The teams play four foursomes and eight singles on Saturday, then four foursomes and 10 singles on Sunday.<\/p><p>Miller's team ranges from 52-year-old Mike McCoy from Iowa and 37-year-old Scott Harvey from North Carolina to eight college players in their teens and early 20s.<\/p><p>''Cap's done an incredible job for us, making us comfortable,'' Hunter Stewart said. \"He knows that each player on the team may prepare a little bit differently, so he's done exactly what makes us feel comfortable before the first tee tomorrow.''<\/p><p>Edwards, who played in four successive Walker Cups from 2001 to 2007, said it was a ''hard task'' choosing ''who to play and who not to play, which is great because quite often you come to the Walker Cup and not everybody has got their game.''<\/p><p>In Saturday morning foursomes, it's: Maverick McNealy and Stewart (United States) vs Ashley Chesters and Jimmy Mullen (Britain and Ireland); Beau Hossler and Denny McCarthy vs Paul Dunne and Gary Hurley; Jordan Niebrugge and Robby Shelton vs Cormac Sharvin and Jack McDonald; Lee McCoy and Mike McCoy vs Jack Hume and Gavin Moynihan.<\/p><p>In Saturday afternoon singles, it's: Bryson DeChambeau (United States) vs Chesters (Britain and Ireland); Stewart vs Dunne; Harvey vs Grant Forrest; McCarthy vs Mullen; McNealy vs Ewen Ferguson; Shelton vs Hurley; Hossler vs Hume; Niebrugge vs Moynihan.<\/p><p>The Britain and Ireland team has a record five Irishmen: Dunne, Hume, Hurley, Moynihan and Sharvin.<\/p><p>The event, first played in 1922 at National Golf Links, is named in honor of former USGA President George Herbert Walker - grandfather and great-grandfather of former U.S. presidents George H.W. Bush and George W. Bush.<\/p><p>The U.S. leads the series 35 to 8.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":[],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-11 18:13:22","updated_date":"2015-09-11 18:20:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150911181240542046608","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/11\/ap-glf-walker-cup-preview"}