{"old_nid":"10046056","title":"McIlroy says schedule more about mental than physical","short_headline":"McIlroy says schedule more about mental than physical","page_title":"McIlroy says schedule more about mental than physical","slug":"AP-GLF--Deutsche Bank-Notebook","headline":"McIlroy says schedule more about mental than physical","description":null,"body":"<p>NORTON, Mass. (AP)  The European Tour went to great lengths to explain why Rory McIlroy is being allowed to compete in the season-ending Race to Dubai even though he won't reach the minimum 13 events when it ends with the DP World Tour Championship in Dubai.<\/p><p>McIlroy has played only nine European Tour events, missing out on three events (Scottish Open, British Open, Bridgestone Invitational) while recovering from injuries to the tendons in his left ankle.<\/p><p>''I have spent the last two weeks examining every angle and every possible solution and I have spoken with Rory and his team, as well as independent medical advisers and some prominent players,'' European Tour chief executive Keith Pelley said. ''I am convinced that he could not commit to any further tournament participation without risking further injury and persistent weakness to the ankle in the future.''<\/p><p>McIlroy, however, made it sound more mental than physical Thursday went asked about wanting to avoid playing three straight weeks.<\/p><p>''Even in years that I haven't injured myself, three I feel is always my number, even though ... I played four last year in the FedEx Cup and whatever,'' he said at the Deutsche Bank Championship. ''I think three is sort of my limit. I can play three. And obviously, there's a physical element to it. But previously, and going forward, it's more a mental. Once you play three weeks in a row, I can feel myself just get a little bit agitated easier. So three weeks is my limit.''<\/p><p>McIlroy returned to competition at Whistling Straits for the PGA Championship and said he was 100 percent, though he skipped The Barclays last week as a precaution to make sure there were no lingering issues with his ankle.<\/p><p>''Ankle is fine,'' he said. ''Ankle is good enough to do what I need to do on the golf course. I won't be running on the soccer field anytime soon. But to run in a straight line, to walk a golf course, to play golf is totally fine.''<\/p><p>---<\/p><p>BACK TO THE OLD: After one week, Jordan Spieth has his old set of irons in the bag for the Deutsche Bank Championship.<\/p><p>For a guy who has won two majors, has four PGA Tour victories and four runner-up finishes this year, why even change? Spieth said he normally changes out his irons once a year, and chose this time because he had a week at home between the PGA Championship and the start of the FedEx Cup playoffs.<\/p><p>He missed the cut at The Barclays, which Spieth attributed to his driving and wedges more than the irons. But he said he noticed a slight difference in the look of the iron and the way it cut through the grass.<\/p><p>With six days between his next event, he asked coach Cameron McCormick to come up to Boston - and bring the old clubs with him.<\/p><p>''At the end of the round, you're not going to sit there and blame the irons. You're going to blame yourself, as I should,'' Spieth said. ''The problems I got in last week were with my driver and wedges. My irons were not the issue.''<\/p><p>He said he would stick with the previous clubs through the Presidents Cup, ''and then I'll find the right fit.''<\/p><p>---<\/p><p>TEXTING TIGER: Jason Day has struck up a friendship with Tiger Woods, and the two often text back and forth, mainly about golf.<\/p><p>Along with his 79 wins on the PGA Tour, Woods wins at a 93 percent rate when he has at least a share of the 54-hole lead.<\/p><p>The trick for Day is interpreting the messages.<\/p><p>''We'll be talking about like finishing on Sundays and the process of stuff,'' Day said. ''His text messages, I have to digest them a little bit more because he is very smart. And he has to kind of dumb it down to my level. I've got to try to think them through.''<\/p><p>Day played with Woods the opening two rounds of the British Open, and they have played practice rounds together.<\/p><p>''With my team and then on top of it he's been the best player for ... arguably one of the best players of all time, who wouldn't want that mentorship from a player like that?'' Day said. ''Especially on the golf course. To be able to receive text messages and ask him questions and him being so open toward me has been fantastic.''<\/p><p>---<\/p><p>BUBBA'S BACK: Bubba Watson skipped the Deutsche Bank Championship pro-am Thursday because of a mild back injury.<\/p><p>Watson suffered a mild strain of his back during the weekend of The Barclays, where he finished third. His agent, Jens Beck, says Watson received therapy the last few days. His trainer recommended one more day of rest as a precaution.<\/p><p>Watson is No. 3 in the FedEx Cup standings going into the second playoff event.<\/p><p>This is the second week in a row that a top player has missed the pro-am with a sore back. Jason Day felt a twinge during the week at The Barclays. He went on to a six-shot victory.<\/p><p>---<\/p><p>DIVOTS: Phil Mickelson has been mathematically eliminated from making the Presidents Cup team on his own. It will be the first time since 1993 - his first full year as a pro - that Mickelson did not qualify on his own for a Presidents Cup or Ryder Cup team. ... Wil Wilcox, No. 89 in the FedEx Cup, has withdrawn with an injury. Only the top 70 advance to the next playoff events, so his season is over. ... Hunter Mahan, the only player to never miss a FedEx Cup playoff event, goes into this week at No. 91.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":[],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-03 16:34:38","updated_date":"2015-09-03 16:47:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150903163416969535508","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/03\/ap-glf-deutsche-bank-notebook"}