{"old_nid":"10019856","title":"Playoff events for top players are practice until East Lake","short_headline":"Playoff events for top players are practice until East Lake","page_title":"Playoff events for top players are practice until East Lake","slug":"AP-GLF--On The Fringe-090115, 1st Ld-Writethru","headline":"Playoff events for top players are practice until East Lake","description":null,"body":"<p>NORTON, Mass. (AP)  Jordan Spieth has missed three cuts on the PGA Tour this year, and The Barclays rated the most irritating for one reason.<\/p><p>''Because it happened about an hour ago,'' he said.<\/p><p>It was Spieth's first tournament as No. 1 in the world, and now he's No. 2. There was no reason to be bothered about that because the ranking could change next week, and the race for No. 1 could last for the rest of the year. Maybe even longer.<\/p><p>No one likes missing cuts. But for Spieth, there are 10 million reasons why The Barclays was as good a time as any to have a weekend off, none related to the trip he made to Baltusrol ahead of next year's PGA Championship.<\/p><p>Because even if he were to miss the cut this week at the TPC Boston, not much will change.<\/p><p>Listening to the top players last week made it clear that only one tournament - The Tour Championship - really matters if they want to win the FedEx Cup and its $10 million bonus. The rest of the playoff events might as well be lucrative practice rounds.<\/p><p>Yes, that's a stretch.<\/p><p>But it also might become a problem at some point for the PGA Tour.<\/p><p>Spieth, much like Rory McIlroy last year and Tiger Woods on three occasions, has had such a dominant season that he was assured being among the top five players in the FedEx Cup finale who had only to win at East Lake to take home golf's richest payoff. It doesn't change if he misses the cut at The Barclays and Deutsche Bank Championship and plays poorly in the BMW Championship. That's the reward of a great season.<\/p><p>It also doesn't change if he were to have won all three playoff events going into Atlanta. Would his odds have been that much greater?<\/p><p>There is no indication Spieth and other stars will be sitting out events, though it's worth listening to their comments going into the FedEx Cup playoffs.<\/p><p>''After the major season is over, which is where we wanted to peak, we've sat back over the last week and said, `How can we get that same momentum to where we can try and peak for the Tour Championship?''' Spieth said when he arrived at Plainfield Country Club.<\/p><p>Bubba Watson, who remained at No. 3 in the FedEx Cup with his third-place finish at The Barclays, reached the same conclusion.<\/p><p>''It's Atlanta that we're all worried about,'' Watson said after taking the 36-hole lead at Plainfield Country Club. ''You can win these next three tournaments, still not win the FedEx Cup. So Atlanta is where we really need to be peaking.''<\/p><p>Woods (2007) and Jim Furyk (2010) are the only players to miss the opening playoff event and still win the FedEx Cup - Woods by choice, Furyk because he was disqualified for oversleeping and missing his pro-am.<\/p><p>McIlroy skipped The Barclays this year because he wanted an extra week to make sure his left ankle was fully recovered. He dropped six spots to No. 15, meaning he will need a couple of strong finishes to get into the top five at East Lake. McIlroy felt the sting of the FedEx Cup last year. The dominant player in golf, he had a pair of top 10s leading to Atlanta, finished second in the Tour Championship and lost out to a guy (Billy Horschel) who started at No. 69 and got hot at the right moment.<\/p><p>Horschel has only two top 10s on the PGA Tour since.<\/p><p>It's not part of Spieth's makeup to sit out. The 22-year-old Texan is playing about 27 tournaments around the world each year. Will he change as he gets older?<\/p><p>The PGA Tour is in a tough spot trying to balance a postseason that is compelling to the very end and a system that rewards the best player.<\/p><p>It's really a case of pick your poison.<\/p><p>If it's a yearlong race, there will be times (such as Woods in 2007 or 2009) when the FedEx Cup in effect is over before the Tour Championship.<\/p><p>To guarantee the FedEx Cup finale is meaningful, the tour resets the points going into the Tour Championship to give everyone a chance. Furyk was No. 11 when he won in 2010. A year later, Bill Haas was No. 25 when he won the Tour Championship - his only victory that year - and the $10 million bonus.<\/p><p>Two solutions should be considered down the road.<\/p><p>Keep it a yearlong race and gradually increase the value of points in each playoff event, ramping it up even more for the Tour Championship. More players might have a chance, though it doesn't as easily punish greatness. Or penalize players for skipping playoff events by deducting points, enough that it would be an incentive to play.<\/p><p>Because as long as the tour puts so much emphasis into one tournament, the top players in the FedEx Cup will face this question: Is the temptation to take one week off greater than the incentive to play?<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["9980781","10006551","10006556","10006561","10019851","10019861"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-01 16:22:55","updated_date":"2015-09-01 16:33:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150901112439250338108","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/01\/ap-glf-fringe-090115"}