{"old_nid":"10088356","title":"Putting method gaining popularity, warrants a caution","short_headline":"Putting method gaining popularity, warrants a caution","page_title":"Putting method gaining popularity, warrants a caution","slug":"AP-GLF--Golf Notes","headline":"Putting method gaining popularity, warrants a caution","description":null,"body":"<p>NORTON, Mass. (AP)  Ian Poulter and Kevin Chappell played together at the Deutsche Bank Championship, and their birdie putts on the par-5 second hole during the second round were significant mainly because of how they read the greens.<\/p><p>Both use AimPoint Express, only Poulter had to do without on this occasion. He was just under 20 feet away. Chappell was about 12 feet away, and his marker was in the line of where Poulter ordinarily would have straddled the line of his own putt to feel the slope of the green.<\/p><p>''I thought it may go right-to-left, but I couldn't tell until I hit it that I picked the wrong line,'' Poulter said.<\/p><p>Poulter has been using the method since January, joining a growing list of players that includes Adam Scott, Stacy Lewis and Hunter Mahan. It has become so popular that the R&A and USGA published a joint statement at the start of the year that cautioned players of one pitfall.<\/p><p>One part of AimPoint Express is to pick an area halfway toward the hole where the feet can feel the slope (and from there players will hold up one or two fingers to help them figure out where to start the putt).<\/p><p>Rule 16-1a, however, makes it illegal for players to touch the line of their putts, which is defined as the line players want their balls to take and includes a ''reasonable distance on either side of the intended line.''<\/p><p>The European Tour went so far as to post a video explaining how the rule can be breeched if players are not careful. The variance of the line will be greater on longer putts than the shorter ones. No one is believed to have been penalized yet (two-stroke penalty or loss of hole in match play).<\/p><p>''You can't stand in your own line, but your own line is vague,'' Chappell said. ''When it first became big, it came up. They were going to try to outlaw it a few years ago, and then it became like, `OK, your line from 4 feet is much smaller and precise than your line from 40 feet.' But it would be pretty hard to stand in your line from 40 feet and have them prove you have an advantage.<\/p><p>''I haven't been warned, but I've had discussions about it.''<\/p><p>---<\/p><p>FINAL MAJOR: The Evian Masters this week in France is the fifth and final major on the LPGA Tour schedule, and it presents another opportunity for an unprecedented feat. Only it doesn't involve Inbee Park.<\/p><p>Park won the Women's British Open last month at Turnberry for her fourth different major, and now she goes after the career Grand Slam (all five majors) at Evian.<\/p><p>But she wouldn't be the first woman to do that.<\/p><p>Karrie Webb won her first major at the du Maurier Classic outside Calgary in 1999, and she wrapped up the career Grand Slam over the next two years (Kraft Nabisco, U.S. Women's Open, LPGA Championship). But when tobacco sponsorship became an issue, the du Maurier was replaced by the Women's British Open, and Webb won that (at Turnberry) in 2002. That gave her what the LPGA referred to at the time as the ''Super Slam.''<\/p><p>If the Australian can win the Evian Masters for a career Grand Slam of six majors, the LPGA may as well called it the Karrie Slam.<\/p><p>---<\/p><p>THE SHORT FUSE: Anyone who plays golf at any level has a story about a short temper or a thrown club.<\/p><p>That includes Jordan Spieth, who spoke before the Deutsche Bank Championship about working with his coach, Cameron McCormick, to turn a short fuse into a longer one. And it led to a story about what he considers his shortest fuse in any sport at any age.<\/p><p>It was golf, of course. He was 11.<\/p><p>He told of slamming his putter into his bag and when he took it out on the next hole, he noticed it was bent. What he didn't know was Rule 4-3b on using a club that has been damaged other than the normal course of play.<\/p><p>''I think I made three birdies in the last six holes with a bent putter, and I was so excited about it,'' Spieth said. ''I was telling my dad after the round, `Look, I bent my putter, I finished with three birdies, I'm still in this thing.'''<\/p><p>He said his father called the assistant pro at the club - without Spieth's knowledge - and the next day, Spieth was invited into his office.<\/p><p>''And they opened the rule book and it showed disqualification,'' Spieth said. ''I was just absolutely torn apart.''<\/p><p>He said that remains his only disqualification. But he's still working on the fuse.<\/p><p>---<\/p><p>LONG YEAR: Carlos Ortiz of Mexico finished his rookie year on the PGA Tour sooner than he wanted after a season that felt much longer than he imagined. The 24-year-old from Guadalajara can't recall playing so much golf in his life. The Deutsche Bank Championship was his 30th event.<\/p><p>''I thought it was bad in college,'' Ortiz said of his schedule. ''I played seven weeks in a row. It's too much. It becomes work. Hopefully, next year I can play better and have more breaks.''<\/p><p>He fell into the same trap of so many rookies who need a week off but are concerned about their position in the FedEx Cup or money list. As long as they're at home, they are giving up a chance at points or money.<\/p><p>Ortiz didn't miss a cut in four starts last fall, and he tied for ninth in Mexico. But his Fedex Cup standing fell out of the top 100 in the summer and he kept playing until he began the playoffs at No. 112 and needed a good week at The Barclays to advance. He was in good shape going into the final round until he opened with a quadruple-bogey 8.<\/p><p>''One of the worst experiences of my life,'' Ortiz said. ''I wanted to cry.''<\/p><p>Instead, he bounced back to play the rest of the round in 1 under and made it to the TPC Boston. This time, he wasn't so fortunate. Ortiz made four straight birdies early in the final round to get inside the projected top 70, only to make triple bogey at No. 9 and shoot 41 on the back nine for a 76. He had the look of a tired golfer.<\/p><p>Next year might not be much easier. Ortiz is likely to make the Olympic team for Mexico.<\/p><p>---<\/p><p>DIVOTS: Now that the LPGA has gone through the inaugural Crown International, it is moving back the dates to qualify so the cutoff is closer to when the event is played. The eight countries will be determined by the world ranking after the first LPGA major of the year at the ANA Inspiration. The four players who qualify for each team will be determined after the second major in June at the KPMG Women's PGA Championship. The tournament will be July 19-24 at Rich Harvest Farms southwest of Chicago. ... Keegan Bradley closed with a 69 to narrowly advance to the third FedEx Cup playoff event. That wasn't the only reason to celebrate. He got engaged at the start of the week to Jillian Stacey.<\/p><p>---<\/p><p>STAT OF THE WEEK: The 54-hole leader has failed to win the last six years at the Deutsche Bank Championship.<\/p><p>---<\/p><p>FINAL WORD: ''Nothing is different. I don't feel it's far off, even though my score is far off. It's just weird. It's almost like a bad dream. I just need to wake up and get the putts to go in again.'' - Jordan Spieth after missing back-to-back cuts for the first time in his career.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10088341","10088346","10088351"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-08 11:24:51","updated_date":"2015-09-08 11:38:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150908112443948033408","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/08\/ap-glf-golf-notes"}