{"old_nid":"10093416","title":"Price takes Sang-moon Bae for Korean matches","short_headline":"Price takes Sang-moon Bae for Korean matches","page_title":"Price takes Sang-moon Bae for Korean matches","slug":"AP-GLF--Presidents Cup, 4th Ld-Writethru","headline":"Price takes Sang-moon Bae for Korean matches","description":null,"body":"<p>Phil Mickelson kept alive a streak and earned a footnote in Presidents Cup history Tuesday when he was selected to play on his 21st consecutive U.S. team.<\/p><p>Mickelson was No. 30 in the standings, the lowest of any player to be a captain's pick.<\/p><p>U.S. captain Jay Haas also took his son, Bill Haas, though that was expected. Bill Haas won his sixth PGA Tour title this year, finished one shot out of a playoff at The Players Championship and was 11th in the standings. His father said he intended to take No. 11 regardless of who it was.<\/p><p>International captain Nick Price selected Steven Bowditch of Australia, who missed qualifying by less than one-hundredth of an average world ranking point, and Sang-moon Bae of South Korea, which attracted the most attention.<\/p><p>The Presidents Cup is Oct. 8-11 in South Korea, the first time it has been held in Asia.<\/p><p>Bae has been ordered to start his mandatory two-year military service in South Korea when he returns home. Price said he has been told that Bae, who won the season-opening Frys.com Open last October, will be able to first play in the Presidents Cup.<\/p><p>Jay Haas said he leaned on his assistant captains and players who already were assured of a spot on the team.<\/p><p>''I am so honored to be on this team,'' Mickelson said. ''And to have it come from input from so many players and assistant captains wanting me to be on the team means a lot to me that I couldn't put it into words. It's just a very special honor to be on the team.''<\/p><p>Mickelson has gone two years since his last victory in the 2013 British Open, and at No. 51 in the FedEx Cup, he risks not making it to the Tour Championship for the second straight year. He was planning to skip the BMW Championship next week north of Chicago if he was not chosen for the Presidents Cup team.<\/p><p>Tiger Woods in 2011 previously was the lowest-ranked player to be a captain's pick. He was No. 29 when Fred Couples took him to Royal Melbourne, and Woods wound up delivering the decisive point.<\/p><p>The announcement Tuesday afternoon was more compelling than any of the golf that has been played in recent years at the Presidents Cup.<\/p><p>The Americans have not lost since 1998 in Australia - there was a tie in South Africa in 2003 - and leads the series 8-1-1 having won the last five times. The Presidents Cup dates to 1994, the first U.S. team for Mickelson as a pro.  That was the only year Mickelson had to rely on being a captain's pick. The other captain's pick for the inaugural matches? Jay Haas.<\/p><p>''If anyone deserves a pick, it's Phil Mickelson,'' Jay Haas said. ''He is without question the leader of our team in the team room, on the golf course. I think the guys trust him 100 percent. The guys on the team were adamant that Phil is the guy, and I think between the captains and team members, Phil was an overwhelming choice to be a pick.''<\/p><p>Among those with experience that Haas skipped over to take Mickelson were J.B. Holmes, Brandt Snedeker, Webb Simpson, Keegan Bradley and Hunter Mahan. No one had been playing well leading up to the final day of qualifying, including Brooks Koepka, who was under consideration. He missed the cut in both FedEx Cup playoff events.<\/p><p>Bill Haas had a chance to win the Wyndham Championship, but he went flat the last few weeks in a grind to make the team and play for his father.<\/p><p>''I couldn't sleep last night,'' said Haas, who is on a family vacation with his father. ''The last few weeks, I really, really wanted to make the team outright. I can't even explain how I was feeling on the golf course. It just showed how much I wanted it.''<\/p><p>Bae was at No. 20 in the International standings, and his selection gives Price a pair of South Korean-born players. Danny Lee is the other, though he grew up in New Zealand and plays under the Kiwi flag.<\/p><p>Bae had deferred his military service while playing the PGA Tour, but the military said he spent too much time at home last year and denied another deferral. Bae appealed the decision, but the military courts ruled against him six weeks ago.<\/p><p>''I think he's had a really tough time,'' Price said. ''His military service has been a cause for concern and it hasn't allowed him to play his best. But I think once he's made the decision, he's played a lot better.''<\/p><p>One other aspect played into Bae's favor. He has won twice on the Jack Nicklaus Golf Course in Incheon, where the matches will be played.<\/p><p>---<\/p><p>This story deletes incorrect reference in third paragraph to Mickelson not needing a captain's pick.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10093541","10056931","10094376","10094381"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-08 20:05:30","updated_date":"2015-09-08 20:15:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150908172349307128108","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/08\/ap-glf-presidents-cup"}