{"old_nid":"10257496","title":"The chase begins for $10 million at Tour Championship","short_headline":"The chase begins for $10 million at Tour Championship","page_title":"The chase begins for $10 million at Tour Championship","slug":"AP-GLF--On The Tee","headline":"The chase begins for $10 million at Tour Championship","description":null,"body":"<p>ATLANTA (AP)  Brandt Snedeker is finishing his ninth year on the PGA Tour, and he already has amassed more than $26 million in earnings.<\/p><p>He never really thought about the money and would only know his total if he took time to look it up.<\/p><p>But there was one exception.<\/p><p>On a Sunday afternoon at East Lake in 2012, Snedeker closed with a 68 to win the Tour Championship and beat out Rory McIlroy for the FedEx Cup title. The latter came with a $10 million bonus - $9 million up front, the other $1 million deferred.<\/p><p>Two days later, he went online to check his account.<\/p><p>''That's the only time I ever checked was that Tuesday,'' Snedeker said. ''They said it would take until Tuesday. And it was there.''<\/p><p>That's been the story at East Lake ever since the FedEx Cup began in 2007. It was different the first year when the money was all deferred. Now, it's 90 percent cash. For most players, especially the top three in the world, this week is more about winning than the money.<\/p><p>Jason Day, Rory McIlroy and Jordan Spieth have combined for 12 victories worldwide and over $25 million in earnings this year. They have won five of the last six majors. They all are in their 20s. And one of them will leave Atlanta as No. 1 in the world.<\/p><p>For everyone else, it's a weighted free-for-all starting on Thursday:<\/p><p>THE BIG THREE: Day, McIlroy and Spieth are being dubbed as the new ''Big Three'' in golf because of their ranking and their majors. Day wants to add Rickie Fowler to the mix, but he's only No. 5 in the world, and while he won The Players Championship in May with arguably the best finish of the year, he still hasn't won a major and only has three PGA Tour victories in his career.<\/p><p>Day reached No. 1 for the first time with his six-shot victory last week in the BMW Championship. He's the most likely to keep the ranking. McIlroy and Spieth would have to win the Tour Championship to get to No. 1.<\/p><p>If that happens, it would be the first time since the world ranking began in 1986 that there was a change at the top for six straight weeks.<\/p><p>THE BIG FIVE: Even though Day has dominated the FedEx Cup playoffs with two victories (Barclays, BMW Championship), the advantage is gone at East Lake. The points have been reset to give everyone a chance at the $10 million, with Day still having the best odds and Harris English (No. 30) the ultimate long shot.<\/p><p>The top five only have to win to claim the FedEx Cup. Day is followed by Spieth, Fowler, Henrik Stenson and Bubba Watson.<\/p><p>Stenson was at No. 2 in 2013 when he won at East Lake to claim the big prize. Watson probably stands the least chance this week. He has never seriously contended at East Lake, with his best finish a tie for fifth.<\/p><p>THE BIG ZERO: One player that is sure to make the PGA Tour nervous is Henrik Stenson.<\/p><p>Every year, it seems someone has a chance to win the FedEx Cup without winning a tournament. There has never been a better opportunity than what Stenson has this week. He was runner-up at The Barclays and Deutsche Bank Championship, moving him from No. 41 to No. 4, and that's where he is now.<\/p><p>If the other players in the top five falter this week and Stenson finished third, he would have enough points (thanks to the reset) to win the FedEx Cup. It would be the only trophy he takes home from the PGA Tour all year.<\/p><p>''I'm just going to try my hardest this week,'' Stenson said. ''But if I finish second or third and win the overall, you won't see me leaving here crying, I know that much. Not out of sadness, anyway.''<\/p><p>THE BIG TASK: Only twice since the FedEx Cup began in 2007 has someone won the Tour Championship and failed to capture the FedEx Cup.<\/p><p>Camilo Villegas won in 2008, but the points system was changed that year and backfired badly. Vijay Singh won the opening two playoff events, and effectively wrapped up the FedEx Cup title by the time he got to East Lake. All the big Fijian had to do was finish 72 holes, which he managed.<\/p><p>The current system - resetting points at the Tour Championship - has been in place since 2009. That year, Tiger Woods was No. 1 and was runner-up to Phil Mickelson, who was No. 14 in the standings. That was quite the image - Woods and Mickelson sharing the stage, each with a trophy. Mickelson won the Tour Championship ($1.35 million and a $3 million bonus for his second-place finish in the FedEx Cup) and Woods won the FedEx Cup and $10 million.<\/p><p>''Let me see if I get this straight,'' Mickelson said that day. ''I shot 65 and he shot (70), and he gets a check for $10 million ... no, I'm just kidding.''<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10243066","10243071","10243076","10243081","10257481","10257486","10257491"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-24 02:25:56","updated_date":"2015-09-24 02:36:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150924022530057392308","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/24\/ap-glf-tee"}