{"old_nid":"10008026","title":"With a 4th win, Jason Day creates a temporary Big 3","short_headline":"With a 4th win, Jason Day creates a temporary Big 3","page_title":"With a 4th win, Jason Day creates a temporary Big 3","slug":"AP-GLF--On Golf: Big 3","headline":"With a 4th win, Jason Day creates a temporary Big 3","description":null,"body":"<p>EDISON, N.J. (AP)  Jordan Spieth was gone, but not forgotten, certainly not by Jason Day.<\/p><p>In his debut as the No. 1 player in the world, Spieth had back-to-back rounds over par for the first time all year and missed the cut. He already was assured of losing the No. 1 ranking back to Rory McIlroy when Day put together a weekend at The Barclays that was even better when put into recent context.<\/p><p>He shot 63-62 on the weekend - the 62 was the lowest closing round by a PGA Tour winner all year - and finished at 19-under 261 for a six-shot win over Henrik Stenson. This was Day's first tournament since he became the first player in a major to reach 20-under par in beating Spieth by three shots at the PGA Championship.<\/p><p>Throw in the Canadian Open and Day has won three of his last four tournaments.<\/p><p>So it seemed to be a natural question who would get his vote as PGA Tour player of the year, which until last week was not really a question at all.<\/p><p>And it still isn't to Day - not yet, anyway.<\/p><p>''Right now, Jordan Spieth gets my vote,'' Day said. ''Winning two major championships at such a young age is big. Winning four tournaments overall is great.''<\/p><p>Then again, there are still three FedEx Cup playoff events remaining, including the Tour Championship that determines the $10 million bonus. It's already been a banner summer for the 27-year-old Australian, and he's not done yet.<\/p><p>''I think winning the FedEx Cup and maybe one or two more tournaments, that could put my name in the mix for player of the year,'' Day said. ''I'm not sure. I'm going to leave that to the peers, to the people. That will definitely throw my name in the mix.''<\/p><p>Spieth already has locked up the points-based award from the PGA of America because of a bonus awarded to multiple major champions, and that's not something to take lightly. The 22-year-old Texan is only the 19th player in 120 years to do that. As only the fourth player to get halfway to the Grand Slam, he handled the pressure by finishing one shot out of a playoff at St. Andrews. And with a runner-up at the PGA Championship, Spieth joined Tiger Woods and Jack Nicklaus as the only players to finish in the top four at all four majors.<\/p><p>He also was runner-up three other times (Houston Open, Texas Open, Colonial), still is nearly $3 million ahead of Day on the money list and is leading the Vardon Trophy for the lowest adjusted scoring average on the PGA Tour.<\/p><p>That's why Day was quick not to dismiss Spieth.<\/p><p>If the Australian were to win the Tour Championship, that makes it interesting, but still probably not enough. The Tour Championship and one other FedEx Cup playoff event? That would be six wins - only Woods and Vijay Singh have done that over the last 20 years - and then it moves the vote closer to a coin flip.<\/p><p>''I'm by far playing the best golf of my life,'' Day said. ''Just the synergy between my golf swing right now and what I've done with my body is working. I'm hitting it a long, long way. I feel like the accuracy has pulled in. ... I feel like Jordan Spieth with how I'm putting. It's a good feeling.''<\/p><p>Another race is shaping up that could prove to be more compelling.<\/p><p>A year ago, when McIlroy won the final two majors with a World Golf Championship in between, he was so clearly No. 1 in the world that the only discussion was who could challenge him. Spieth and Day provided the answer, with four wins apiece on the PGA Tour, and three of the four majors.<\/p><p>Day will have a mathematical chance to reach No. 1 if he were to win the Deutsche Bank Championship. There was chatter about a modern Big Three after Day won the PGA Championship, and this victory in the Barclays, along with his realistic chance of getting to No. 1, only confirms it.<\/p><p>McIlroy didn't play The Barclays to give his left ankle one more week of rest as a precaution. He tied for 17th in the PGA Championship, his first time competing in nearly two months, and he has won on the TPC Boston.<\/p><p>Spieth has a knack for bouncing back quickly. The last time he missed a cut was at The Players, and over his next eight starts he had two wins (including the U.S. Open), two runner-up finishes and two third-place finishes. The TPC Boston is where his stock really began to rise two years ago when he closed with a 62.<\/p><p>Yes, the majors are over.<\/p><p>Golf still has the potential to be plenty compelling over the next four weeks. That's what the PGA Tour wanted.<\/p><p>Only it has nothing to do with $10 million.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["9993456","10006551","10006556","10006561"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-08-31 10:25:18","updated_date":"2015-08-31 10:35:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150831102433769761408","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/08\/31\/ap-glf-golf-big-3"}