{"old_nid":"10170156","title":"Spieth assured of a long hotel stay in Chicago","short_headline":"Spieth assured of a long hotel stay in Chicago","page_title":"Spieth assured of a long hotel stay in Chicago","slug":"AP-GLF--Golf Notes","headline":"Spieth assured of a long hotel stay in Chicago","description":null,"body":"<p>LAKE FOREST, Ill. (AP)  Jordan Spieth has a green jacket, a U.S. Open trophy and an eye for photojournalism.<\/p><p>Spieth has been the toast of golf for much of the year with his bid for the Grand Slam and eventually joining Jack Nicklaus and Tiger Woods as the only players to finish in the top four at all four of the majors. But after missing consecutive cuts, he couldn't help but notice one difference in the coverage.<\/p><p>Not through words, but photos.<\/p><p>The smile was replaced by a look of despair. The head was down. The body language was screaming a bad day on the golf course.<\/p><p>''It's actually amazing the amount of pictures photographers must take to get these crazy reactions that randomly you don't think anybody is around that you're giving and they capture it,'' he said. ''It's not the most flattering of pictures that happen when you're not playing well.''<\/p><p>As for the words? He doesn't read much, though he can sense how quickly fans can jump on and off a bandwagon. Spieth doesn't seem to mind, either, because he reacts that way to the sports he watches and ''so why can't people be that way with me?''<\/p><p>Golf does seem to be fluid at the moment. Spieth and Rory McIlroy have traded the No. 1 ranking the last few weeks. Jason Day has won three of his last five tournaments, including a major. And then Rickie Fowler rallied to win the Deutsche Bank Championship.<\/p><p>''Everyone has their opinions, and the hardest thing for me to do is not to react to that,'' he said. ''Two weeks ago everyone said, `You're the best there is, you're the best in the world, you're awesome, man.' Not a bad thing said. And then Jason wins - `Jason is the best in the world, man, he's awesome.' ... Rickie wins and all of a sudden people are coming out of their igloos and they're saying, `Man, that's my guy. He's the best in the world.'<\/p><p>''You just need to keep your head down, stay focused and try and be the guy that people are talking about next week.''<\/p><p>---<\/p><p>INKSTER ADVICE: Juli Inkster had no shortage of sports figures she leaned on for advice before heading to Germany as U.S. captain at the Solheim Cup. From the hockey world, she spoke to Ray Whitney and Jamie Baker. From baseball, she went to San Francisco Giants manager Bruce Bochy and pitching coach Dave Righetti.<\/p><p>''I'm a sports junkie, and I love talking to them about sports ... about teams and how do you get certain individuals going if they're struggling, or how do you manage 40 guys on a roster and you only play 12?'' she said. ''It's just fascinating how everybody does it kind of differently.''<\/p><p>Throw in some golf, too. She talked to Corey Pavin, Jay Haas, Paul Azinger and Phil Mickelson.<\/p><p>There was even mention Tuesday of Inkster using the ''pod'' system that Azinger employed at Valhalla in the 2008 Ryder Cup, which is the only Ryder Cup the Americans have won since 1999.<\/p><p>''I'm using kind of a variation of it,'' Inkster said. ''It's still getting tweaked and stuff. But the girls kind of know what I want to do and how I want to do it. I'll get all that come Sunday, give it all to you on Sunday. But right now we're just kind of working the system.''<\/p><p>---<\/p><p>ONE MORE WEEK: Jerry Kelly made a birdie on the final hole of the Deutsche Bank Championship to advance to the third event of the FedEx Cup playoffs north of Chicago. Kelly is from Wisconsin and refers to the BMW Championship as a home game.<\/p><p>Except that it's not home-field advantage. This is the first time he's ever played Conway Farms.<\/p><p>Kelly didn't advance to the third event in 2013 when it was held at Conway Farms. He has made it to the Tour Championship only once (2009) since the FedEx Cup began, and this year isn't looking all that great. Kelly is at No. 65, meaning he will need at least a third-place finish to get into the top 30 to reach the FedEx Cup finale at East Lake.<\/p><p>''I always like to look at it as pressure,'' Kelly said. ''The fear is if you have a difficult start that you just say, `Oh, it's not in the cards, anyway.' I need to make sure, especially on a course like this, that when the wind is going to blow, anything can happen, and one great round can take away a lot of bad that has happened.<\/p><p>''I'm not going to let myself get down, even if it gets into a tough starting block position,'' he said. ''Four days automatically helps a shorter hitter tremendously because I can still get one of the low rounds in there.''<\/p><p>---<\/p><p>THE OLD MAN: Phil Mickelson had a big part in encouraging Fred Couples to use a captain's pick on Jordan Spieth two years ago at the Presidents Cup. This time it was the 45-year-old Mickelson who needed to be picked, and Spieth was thrilled.<\/p><p>''I don't think there's anybody better in the locker room,'' Spieth said. ''He's unbelievably positive. He brings some adrenaline and excitement we don't normally see in people his age to these team events.''<\/p><p>Spieth is 22. Mickelson had already won twice on the PGA Tour before Spieth was even born.<\/p><p>''Boy, it's fun having him around,'' Spieth said. ''He walks in, his stories - you guys have all heard plenty of them - his excitement, his just positive nature, his ability to come up to you and tell you that he knows you're going to win your match today before you even start. It's great to have that guy who's seen a lot of rough patches in the Ryder Cup. He's seen a couple wins in the Ryder Cup and a lot of wins in the Presidents Cup. He's seen it all as far as these team events go.<\/p><p>''So you just have that ability to trust him, and we like that.''<\/p><p>---<\/p><p>DIVOTS: Jordan Spieth, Bubba Watson and Dustin Johnson are among the Americans who plan two trips to Asia - for the Presidents Cup in South Korea (Oct. 8-11) and the HSBC Champions in Shanghai (Nov. 5-8). Johnson plans three trips. He's also planning to play the Hong Kong Open. Johnson said he would fly back to Los Angeles after each event instead of staying over. ... Inbee Park won the Rolex Annika Major Award for the best overall finishes in the LPGA majors. Park won two majors this year and her worst finish was a tie for 11th in the ANA Inspiration. ... The PGA Tour is using Twitter to allow fans to vote which uniforms the U.S. and International teams should wear in the opening session in South Korea on Oct. 8.<\/p><p>---<\/p><p>STAT OF THE WEEK: Billy Horschel (69) is the only player to start the FedEx Cup playoffs out of the top 20 and win the $10 million bonus.<\/p><p>---<\/p><p>FINAL WORD: ''We're playing better than the Americans.'' - Suzann Petterson, on why the tide has swung in Europe's favor at the Solheim Cup.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":[],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-15 19:08:40","updated_date":"2015-09-15 19:21:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150915190829434767708","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/15\/ap-glf-golf-notes"}