{"old_nid":"10047096","title":"Mickelson needing big week for chance at 21st straight team","short_headline":"Mickelson needing big week for chance at 21st straight team","page_title":"Mickelson needing big week for chance at 21st straight team","slug":"AP-GLF--Presidents Cup-Mickelson, 1st Ld-Writethru","headline":"Mickelson needing big week for chance at 21st straight team","description":null,"body":"<p>NORTON, Mass. (AP)  Phil Mickelson only realized a few days ago his proud streak of qualifying for 20 consecutive teams was over.<\/p><p>Even if he were to win the Deutsche Bank Championship this week, he could not finish among the top 10 players who automatically qualify for the Presidents Cup team. That leaves him one important week to at least make an impression as a captain's pick.<\/p><p>''I would love to be on the team,'' Mickelson said Thursday after his pro-am round at the TPC Boston. ''If I can play well this week, hopefully I'll have a chance to be a pick. And if I do, then I'll keep playing to try to stay sharp. If I don't play well this week and I'm not a pick, then I'm not sure what I'll do hereafter.''<\/p><p>It's one of the most impressive streak in golf, a testimony to two decades of Mickelson consistently playing at a high level. He qualified for the first Presidents Cup in 1994, and then qualified for every Ryder Cup and Presidents Cup since then.<\/p><p>Tiger Woods was playing his third tournament as a pro during the 1996 Presidents Cup team. He missed the 2008 Ryder Cup with a knee injury and had to rely on a captain's pick for the Ryder Cup in 2010 and the Presidents Cup in 2011.<\/p><p>Jim Furyk played on every U.S. team dating to the 1997 Ryder Cup, a streak that ended when he was left off the 2013 Presidents Cup team.<\/p><p>Mickelson knew he needed a win during the FedEx Cup playoffs and one other good finish. He shot 73 on Sunday and tied for 50th in The Barclays. The Presidents Cup is based on FedEx Cup points. Mickelson is 1,559 points behind the 10th spot, and the most he can earn this week is 1,100 points.<\/p><p>The Presidents Cup is Oct. 8-11 in South Korea.<\/p><p>Mickelson was a runner-up at the Masters, tied for fourth at the Wells Fargo Championship and tied for third at the St. Jude Classic. He also was in the top 20 at two other majors. But he has been finishing middle of the pack at most events, and is in danger of going two straight years without a victory for the first time in his career.<\/p><p>''I think I need to have a good week to show that I'm playing well,'' Mickelson said. ''Again, it's been close. I haven't been playing horrific. I've been making cuts and having decent finishes. But I haven't played to the level that I expect to play. I'd love to put it together this week and be on the team. But you've got to play the guys that are going to help you win.''<\/p><p>Eighteen players are ahead of Mickelson in the U.S. standings. Mickelson did not have an answer on what he needed at the TPC Boston to merit a wild-card selection.<\/p><p>''I'm just trying to play well this week and see how it goes,'' he said. ''I want to be on the team, not only to keep the streak but they're my favorite weeks - playing with the guys and the match play format. I love being on the team. But if I haven't played well enough to make it, then I understand that, too.''<\/p><p>He said he has spoken to Haas, and he said Haas has indicated he wants Lefty on the team.<\/p><p>''But from my standpoint, I've got to earn it, too,'' he said.<\/p><p>Two years ago, Mickelson played the final round at the TPC Boston with 20-year-old Jordan Spieth, who closed with a 62. Spieth was so impressive that day that Mickelson sent a text to U.S. captain Fred Couples that said, ''Dude, you've got to pick this guy.''<\/p><p>Maybe that's the kind of performance Mickelson now needs himself.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10047086","10047091"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-03 18:41:00","updated_date":"2015-09-03 18:48:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150903175943422562008","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/03\/ap-glf-presidents-cup-mickelson"}