{"old_nid":"10097991","title":"Inbee Park eyeing golf career Slam at Evian Championship","short_headline":"Inbee Park eyeing golf career Slam at Evian Championship","page_title":"Inbee Park eyeing golf career Slam at Evian Championship","slug":"AP-GLF--Evian Championship","headline":"Inbee Park eyeing golf career Slam at Evian Championship","description":null,"body":"<p>PARIS (AP)  Serena Williams isn't the only woman in sight of a Grand Slam this weekend.<\/p><p>Inbee Park can achieve a career Grand Slam in golf by winning the Evian Championship starting on Thursday near the French Alps.<\/p><p>Park won the Evian on the edge of Lake Geneva in 2012, but it came a year before the U.S. LPGA Tour made it the fifth and final major on its calendar.<\/p><p>To mark the occasion, the tour has gone into hyperbole. When Park won the Women's British Open last month, becoming the seventh woman to win four different majors, the tour called that the ''career Grand Slam.'' Adding the Evian will give her a ''Super Career Grand Slam.''<\/p><p>Regardless of how it's described, Park says it's already been a great year.<\/p><p>Such has been her dominant form that she has already wrapped up the Rolex Annika Major Award, which rewards the player with the best record in the five majors. Even if she misses the Evian cut, she has an unassailable lead in the standings and will succeed Michelle Wie, who won the inaugural award last year.<\/p><p>Park has won six of the last 14 majors. She has seven to her name, and two this year. And her appetite for them hasn't dimmed.<\/p><p>''I've got my name on every major championship trophy, but I won Evian before it became a major,'' the South Korean said. ''So it would be really good to win it again this year.''<\/p><p>The other major winners this year were Brittany Lincicome and In Gee Chun.<\/p><p>Still with a shot at becoming the youngest major winner is 18-year-old Lydia Ko of New Zealand.<\/p><p>The No. 2-ranked Ko, who tied for third at the British Open, had her confidence boosted by victory at the Canadian Pacific Open, where she claimed her third title of the year.<\/p><p>Hyo-Joo Kim of South Korea, who came from a shot back on the last hole to beat Karrie Webb by one shot last year, will be trying to win a second straight Evian, a feat nobody has achieved since it became an official tour event 15 years ago.<\/p><p>The tournament at Evian Resort will also serve as a final outing for the U.S. and European Solheim Cup teams, who will square off at the match-play competition next week in St. Leon-Rot, Germany.<\/p><p>''Certainly, it's been in the front of everyone's mind here with a huge major championship, the last one of the year, and then going next week with both teams playing here, it's certainly something that people are talking about,'' said American Morgan Pressel, the youngest major champion in tour history. ''At the end of the day, if I can play well this week, that gives me a lot of confidence going into next week.''<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":[],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-09 07:06:30","updated_date":"2015-09-09 07:12:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150909070620563516108","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/09\/ap-glf-evian-championship"}