{"old_nid":"10253756","title":"Big 3 battle for $10 million at Tour Championship","short_headline":"Big 3 battle for $10 million at Tour Championship","page_title":"Big 3 battle for $10 million at Tour Championship","slug":"AP-GLF--Tour Championship","headline":"Big 3 battle for $10 million at Tour Championship","description":null,"body":"<p>ATLANTA (AP)  The best three players in golf have combined to win 12 tournaments and over $25 million this year, so the appeal of a $10 million bonus for capturing the FedEx Cup might not be as great as simply winning the final showdown of the season.<\/p><p>But there was a time when money mattered for Jason Day, Rory McIlroy and Jordan Spieth.<\/p><p>McIlroy was an 18-year-old rookie in 2007 playing his second tournament as a pro when he finished third at the Dunhill Links Championship. That not only wrapped up his European Tour card, it paid just over $300,000 (211,332 pounds).<\/p><p>''I remember I wanted this watch,'' McIlroy said Wednesday. ''And I remember it was the week after the Dunhill Links in 2007, and it was one of the bigger prize funds on the European Tour. At this stage, the money from the European Tour was just going into my debit account, whatever bank I was using in Ireland. And I went to get money out of the ATM the week after and the check had obviously been put in.<\/p><p>''And I wanted to check my balance and it was like 220,000 pounds, and I was like ... I mean, I went straight to the store and bought the watch.''<\/p><p>Now they're more interested in a pair of titles - the Tour Championship and the FedEx Cup - along with a single-digit number.<\/p><p>The battle for No. 1 enters its sixth straight week in golf.<\/p><p>Day reached the pinnacle for the first time in his career with no argument. His six-shot victory in the BMW Championship last Sunday was his fourth win in his last six starts. That includes a record score at the PGA Championship and a six-shot win at another FedEx Cup playoff event.<\/p><p>Day also is No. 1 going into the FedEx Cup finale at East Lake, though with a much slimmer margin.<\/p><p>To make the Tour Championship a weighted free-for-all for the 29 players at East Lake (Jim Furyk withdrew with injury), the points have been reset so that the top five players only have to win the tournament to claim the $10 million bonus.<\/p><p>Day is followed by Spieth, Rickie Fowler, Henrik Stenson and Bubba Watson.<\/p><p>McIlroy, who missed two months and one playoff event because of an ankle injury, is No. 11. For him to claim the FedEx Cup, he would have to win the Tour Championship and the top five in the standings would need to finish out of the top six depending on their ranking.<\/p><p>Part of him wonders if he's due for that to happen. McIlroy was the No. 1 seed in 2012 on the strength of winning two FedEx Cup playoff events, tied for 10th at East Lake and lost out to Brandt Snedeker. He was the top seed going into the postseason a year ago on the strength of his two majors, was runner-up in the Tour Championship and finished behind Billy Horschel, who won the last two events.<\/p><p>''So maybe this time being outside ... maybe get the job done a different way,'' McIlroy said.<\/p><p>No one has ever won three FedEx Cup playoff events, and that's an opportunity for Day. The 27-year-old Australian is pounding his driver long and straight, his short game is finally getting its due attention and he's putting well. It's an unbeatable combination, as the victories attest. Perhaps even more daunting is that Day is 101-under par in his last seven tournaments dating to the British Open.<\/p><p>No one knows how well Day is playing more than Spieth. They have been in the same group seven of the last nine rounds dating to Sunday at the PGA Championship. Spieth was runner-up at Whistling Straits, missed the cut in the opening two FedEx Cup events and then got his game turned around last week north of Chicago.<\/p><p>Or at least he thought he did.<\/p><p>Spieth opened at 65-66 - and he was still seven shots behind Day.<\/p><p>''What he did ... I mean, he destroyed my score in those rounds for lack of a better term,'' Spieth said. ''It is very motivating because my personality, I don't like getting beat in anything and I'm very stubborn. It doesn't make me angry. It makes me want to get back to the level I was playing at this whole year, and see if the top of my game can beat the top of anybody else's game when they're at their best.''<\/p><p>That's the beauty of this Tour Championship. All the best are at their best. The top five in the FedEx Cup are among the top six in the world ranking. Starting Thursday, they get one last chance to battle for at least one trophy (Tour Championship), maybe two (FedEx Cup) and a $10 million bonus.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10218891","10245031","10264156"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-24 17:15:16","updated_date":"2015-09-24 17:24:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150923164524903140908","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/23\/ap-glf-tour-championship"}