{"old_nid":"10020981","title":"Players speak, Donald listens and minor changes to Doral","short_headline":"Players speak, Donald listens and minor changes to Doral","page_title":"Players speak, Donald listens and minor changes to Doral","slug":"AP-GLF--Golf Notes","headline":"Players speak, Donald listens and minor changes to Doral","description":null,"body":"<p>NORTON, Mass. (AP)  Once among the most popular stops on the PGA Tour schedule, Trump National Doral had more players grumbling than ever. The complaints mainly were that the power players had too big an advantage.<\/p><p>The tour was listening, and so was The Donald.<\/p><p>As part of constant feedback on golf courses, players were allowed to submit their thoughts (signed or anonymous). Those were presented to Trump and work has been underway to make a few changes for next year's Cadillac Championship.<\/p><p>''I just went over some changes to make it more friendly for guys who hit it my length instead of it being a bomber's paradise,'' said Brandt Snedeker, among those who offered reasonable suggestions. ''I think Gil (Hanse) tried to do the right thing to tighten it up, but it's hard to see how a golf course plays until guys play it. You don't know what bunkers are in play and out of play.''<\/p><p>The changes are mostly about the bunkers on six holes - Nos. 2, 6, 7, 12, 14 and 17.<\/p><p>The seventh hole was a prime example with two bunkers to the left and another bunker farther out on the right. The fairway sloped toward the right bunker, leaving the medium-length players limited options - a tiny landing zone, playing short of the left bunkers for a longer approach over the water to the green, or seeing their tee shots tumble into a bunker and facing that shot over water.<\/p><p>Andy Pazder, chief of operations for the PGA Tour, said a shorter bunker is being removed and another bunker is being added further out on the left.<\/p><p>''That makes the tee shot more fair,'' he said. ''And even the long hitters who can't quite carry the bunkers on the left and still hit 3-wood comfortably.''<\/p><p>That was just one example. The other changes are mainly about covering over some bunkers that were in play only for the medium hitters and extending or moving bunkers that would challenge the longer hitters.<\/p><p>Pazder described the changes as a result of ''continuous feedback we've received over the last few years after Gil's redesign.''<\/p><p>''This is designed to create a little more of a level playing field as it relates to those who carry it 300 yards and those who don't,'' he said.<\/p><p>Dustin Johnson won this year. Next on the leaderboard were J.B. Holmes, Bubba Watson, Henrik Stenson and Adam Scott.<\/p><p>---<\/p><p>MINOR MOVEMENT: Points in the FedEx Cup playoffs are worth four times the value this year, down from five times the value a year ago. The idea was to give players a chance to move up with good play, without making it too volatile.<\/p><p>Here's how it shaped up after The Barclays:<\/p><p>Henrik Stenson finished alone in second at The Barclays and moved from No. 41 to No. 4, the same change it would have been last year.<\/p><p>Zac Blair started at No. 106, finished in a two-way tie for fourth and moved to No. 45. A year ago, if the player at No. 106 had finished in a two-way tie for fourth at The Barclays, he would have moved to No. 35.<\/p><p>One reason for the change was to avoid someone toward the bottom making too large a jump. Martin Laird was at No. 95 in 2010, was runner-up at The Barclays and shot all the way up to No. 3. Had that happened this year, the No. 95 player would have gone to No. 10.<\/p><p>---<\/p><p>CADDIE KNACK: If the American players can't win the Ryder Cup, maybe their caddies can.<\/p><p>The World Caddie Matches is in the planning stages for next year, a 36-hole event over one day featuring 16 professional tour caddies from the United States against 16 from around the world. It would be fourball matches in the morning, followed by singles in the afternoon.<\/p><p>Steve Hulka, the captain of the U.S. caddie team, says Foxwoods Resort & Casino in Connecticut has offered to host the inaugural event. The draw for matches would be held after the conclusions of The Barclays, and the competition would be the following day.<\/p><p>Mike ''Fluff'' Cowan is the assistant captain for the U.S. Captains for the caddies from around the world are Gareth Lord (who works for Henrik Stenson) and Mark Fulcher (Justin Rose). Still to be determined is a qualifying process for both teams.<\/p><p>And just like the tours on which they work, the plan is to have a charity component. The idea is for the caddie of each PGA Tour winner starting with the Travelers Championship to donate $500 into a fund, with the caddie for the runner-up donating $300.<\/p><p>Hulka said it could turn into an event played before each Ryder Cup and Presidents Cup.<\/p><p>---<\/p><p>SMALL MARGINS: The final round of the Wyndham Championship was another example of how thin the margins can be in the FedEx Cup.<\/p><p>Cameron Percy and Vaughn Taylor were not remotely close to getting into the top 125 and qualifying for the playoffs, but the final hour did make a difference. Taylor made bogey on three of his last four holes to finish at 6-under 274, two shots behind Percy, who played that stretch at 2 over and finished two shots ahead.<\/p><p>Percy wound up No. 150 in the FedEx Cup with 360.773 points, just ahead of Taylor at 360.667 points.<\/p><p>But the FedEx Cup bonus structure pays out to 150th place. By finishing sixth-thousandths of a point ahead, Percy got $32,000. More than money, he has conditional status on the PGA Tour next year, and full status on the Web.com Tour for the weeks he doesn't get into PGA Tour events.<\/p><p>---<\/p><p>DIVOTS: Sam Horsfield of England has withdrawn from the Walker Cup because of personal reasons. He was replaced by Ewen Ferguson of Scotland. ... Jon Rahm of Spain, a senior at Arizona State, won the Mark H. McCormack Medal as the No. 1 player in the World Amateur Golf Ranking. He is the first Spaniard to win the award, and provided he stays an amateur, will be exempt into the U.S. Open and British Open. Rahm tied for fifth at the Phoenix Open this year. ... Players hoping for a hole-in-one might stand a better chance with Scott Tway as the caddie. He works for Brian Harman, who made two aces Sunday at The Barclays. And he was working for brother Bob Tway when he made two aces in the same tournament at the 1994 Memorial. ... Jeff Maggert and amateur Trip Kuehne are among those to be inducted into the Texas Golf Hall of Fame on Oct. 12 in San Antonio.<\/p><p>---<\/p><p>STAT OF THE WEEK: Jason Day has four PGA Tour wins this year, the most by an Australian in one year since Jim Ferrier won five times in 1951.<\/p><p>---<\/p><p>FINAL WORD: ''I would have made a fortune on the Champions Tour this year.'' - Kevin Chappell, who had at least one round of 75 or worse in seven tournaments this year. Champions Tour events typically are 54 holes.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10004046","10020976"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-01 12:54:38","updated_date":"2015-09-01 13:08:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150901125359777363408","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/01\/ap-glf-golf-notes"}