{"old_nid":"10169871","title":"Jason Day finds the missing piece","short_headline":"Jason Day finds the missing piece","page_title":"Jason Day finds the missing piece","slug":"AP-GLF--On The Fringe-091515","headline":"Jason Day finds the missing piece","description":null,"body":"<p>LAKE FOREST, Ill. (AP)  Two wins in seven years on the PGA Tour doesn't compute for a player with the talent and work ethic of Jason Day. It was simple enough to attribute his slow start to injuries, and that would be accurate with one stipulation.<\/p><p>It wasn't all physical.<\/p><p>The most fragile part of his body might have been between the ears.<\/p><p>''I always thought I had the skills to play and win at the highest level and be competitive,'' Day said. ''But mentally, I think the last piece of the puzzle was to really believe. I mean, it's easy to say, `Just go ahead and believe in yourself.' But how do you believe in yourself when you don't know what to believe in? That was the hardest part for me.''<\/p><p>The 27-year-old Australian seems to have figured it out.<\/p><p>A weakness has become a strength, and Day is becoming a force in the new era of golf.<\/p><p>His victory at The Barclays to start the PGA Tour's postseason was his second in a row and fourth of the year. It not only moved Day to No. 1 in the FedEx Cup, but it also put him in position to reach No. 1 in the world. Day still has to navigate past Rory McIlroy and Jordan Spieth, which won't be easy, though he is getting closer. Instead of having to win this week at Conway Farms, a runner-up finish might be enough to reach the top.<\/p><p>And to think it all started with what looked like another failure.<\/p><p>Day had a 30-foot birdie putt on the 18th hole at St. Andrews to join the playoff and he left it short. It was his second straight major with a share of the 54-hole lead. It was another close call. Only this time, frustration gave way to a sense of peace.<\/p><p>''All those major championships I lost, it was built-up scar tissue,'' Day said. ''Scar tissue can be bad. But it can also heal and be good for you. No matter what happened that whole week, I felt calm. I didn't play flawless golf, but I didn't make mistakes. There was no stress. I was patient with myself. No matter what happened, I was letting it unfold and not forcing the issue.''<\/p><p>That was different from how he felt when was runner-up at the Masters in 2011, and at Augusta National two years later when he had a two-shot lead standing on the 16th tee and finished two shots out of a playoff, or when he bogeyed the last hole at Merion and finished two shots behind.<\/p><p>''I had confidence, but I didn't have the `I'm going to go out there and beat everyone here' confidence,'' Day said.<\/p><p>Spieth was surprised to hear Day didn't truly believe he could be the best until this summer. Spieth saw the full potential of Day at Whistling Straits, when they played together in the final round and Spieth could never catch up.<\/p><p>''I would argue Jason believed in himself every time he stepped on the first tee,'' Spieth said. ''I think maybe he just had a bit of doubts as it got into the heat on the last round ... where at certain times he'd just have a little bit of self-doubt for tiny stretches. And if you do that, you're not going to win the tournament. So for him to say he just started truly believing in himself around July, I would argue a player of his caliber has that self-belief all the time. He just may have lost it here and there.<\/p><p>''Now, he doesn't lose it.''<\/p><p>Players go through hot streaks all the time. What separates great players is being able to sustain it.<\/p><p>That's what Spieth has done this year, and pretty much all three of his years on tour. Spieth has four wins, including two majors. He has 10 other top-10 finishes, which make his consecutive missed cuts startling, but little more than that. Adam Scott began his climb to No. 1 in the world a year ago by making sure he was a regular on the leaderboard at just about every event. McIlroy still has a few valleys, though his peaks are bordering on Mt. Everest.<\/p><p>And that's where Day is headed. All because he finally figured out how to combine a little self-belief with his powerful swing and relentless work habits.<\/p><p>''I feel like everything is a lot clearer to me,'' Day said. ''As a junior and an amateur, I'd walk onto the putting greens and feel like I was the guy to beat. And it took me a long time to really try and feel that way. Obviously, I'm not saying that I feel that way all the time here, but especially when I was playing some really good golf at the PGA, The Barclays, I felt like I was the guy to beat.''<\/p><p>''That's the mentality I have to get to all the time,'' he said. ''And I think once I get to that, then I'll be a lot more consistent.''<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10169861","10169866"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-15 18:23:18","updated_date":"2015-09-15 18:39:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150915182236547756308","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/15\/ap-glf-fringe-091515"}