{"old_nid":"10182856","title":"TEEING IT UP: 3rd FedEx Cup playoff event","short_headline":"TEEING IT UP: 3rd FedEx Cup playoff event","page_title":"TEEING IT UP: 3rd FedEx Cup playoff event","slug":"AP-GLF--On The Tee","headline":"TEEING IT UP: 3rd FedEx Cup playoff event","description":null,"body":"<p>LAKE FOREST, Ill. (AP)  This is one of those weeks where Jordan Spieth felt confident enough to make a guarantee.<\/p><p>He wasn't talking golf. He was talking hotels.<\/p><p>''When they ask what day I'm checking out I can say, `I'm checking out on Sunday.' It's nice,'' Spieth said.<\/p><p>He was joking. Maybe.<\/p><p>Spieth missed the cut in the opening two FedEx Cup playoff events, the first time in his career he has gone home early in back-to-back events. He managed to go back to No. 1 in the world for one week before returning the ranking to Rory McIlroy during an off week. The slow start in the PGA Tour postseason did cost him No. 1 in the FedEx Cup, though he still has a clear shot at the $10 million bonus next week in Atlanta.<\/p><p>The BMW Championship starts Thursday with a 70-man field and no cut at all. So the 22-year-old has that going for him.<\/p><p>The third FedEx Cup playoff event is the final stop before the top 30 advance to the Tour Championship next week at East Lake. It's important to get into the top five because those players only have to win the Tour Championship to claim golf's biggest payoff. The top three - Jason Day, Spieth and Rickie Fowler - are assured of that.<\/p><p>Most of the drama figures to be at the bottom.<\/p><p>This is how the final stop before Atlanta is shaping up:<\/p><p>THE TOP: Henrik Stenson has moved from No. 41 to No. 4 in two weeks without winning. He was runner-up to Day at The Barclays and runner-up to Fowler at the Deutsche Bank Championship. Another runner-up finish at Conway Farms could move him all the way up to No. 2.<\/p><p>Winners of FedEx Cup playoff events usually only have to win to assure going into the top five. But there has been so much dominance this year - Day, Spieth and Fowler have combined for 10 wins on the PGA Tour - that down to No. 29 has a mathematical chance to get into the top five. That spot belongs to Russell Knox, who says his best club right now is the putter.<\/p><p>THE BUBBLE: Louis Oosthuizen is holding down the 30th spot, and he'll have to play decent to keep it.<\/p><p>The trouble might be right above him. There's a history in the BMW Championship of players just inside the top 30 having a poor week and falling out. Bill Haas is at No. 27, and he knows the sting of narrowly missing out. Haas finished at No. 31 in 2010 and at No. 32 in 2012.<\/p><p>Harris English is No. 32 and has bad memories of this event. He wound up No. 32 a year ago and No. 31 the year before that.<\/p><p>The last time the BMW was at Conway Farms, Matt Jones missed a 7-foot putt on the last hole that cost him a trip to East Lake.<\/p><p>THE BOTTOM: George McNeill is at No. 70 and needs a great week to advance.<\/p><p>The focus is on Hunter Mahan at No. 52, mainly because he has never missed a playoff event since the FedEx Cup began in 2007. He tied for fourth in Boston to advance, but needs another big week to keep his streak alive.<\/p><p>Jerry Kelly had to make a 3-foot birdie putt on his final hole in Boston just to get to Chicago. His clock is ticking.<\/p><p>THE LATE ARRIVAL: Sergio Garcia would like to get to the Tour Championship, though the Spaniard is not losing sleep over it. Otherwise, he would have played much sooner than the BMW Championship. Garcia sat out The Barclays and the Deutsche Bank Championship, and his standing dropped from No. 31 to No. 54.<\/p><p>He still earned as many points as Spieth (no points for two missed cuts), although Spieth could afford it.<\/p><p>MICKELSON: Phil Mickelson was planning to shut it down for the year until he was picked for the U.S. team at the Presidents Cup. He is No. 61 and will be done for the year unless he finishes around third. But his enthusiasm for the game suddenly picked up.<\/p><p>''This is the most excited I've been this late in the year because I'm looking forward to being on the team,'' Mickelson said. ''It's meant a lot to me to be a part of that team, and I want to play well and I want to get some momentum.''<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10179721","10179731","10182836","10182841","10182846","10182851"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-17 03:10:07","updated_date":"2015-09-17 03:22:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150917030914304570308","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/17\/ap-glf-tee"}