{"old_nid":"10194416","title":"The Jason Day train rolls through Chicago","short_headline":"The Jason Day train rolls through Chicago","page_title":"The Jason Day train rolls through Chicago","slug":"AP-GLF--On The Tee","headline":"The Jason Day train rolls through Chicago","description":null,"body":"<p>LAKE FOREST, Ill. (AP)  Jason Day was in such a zone that he didn't even know the score.<\/p><p>He nearly chipped in for eagle on his second straight hole and threw his head back in despair, perhaps expecting everything to go in Thursday at the BMW Championship. The birdie put Day at 10-under par with one hole remaining, and moments after he hit his tee shot on No. 9, the horn sounded to stop play because of thunderstorms.<\/p><p>Day smashed that tee shot 346 yards with the wind at his back, leaving him 44 yards to a front pin.<\/p><p>Jordan Spieth, along for the ride on yet another amazing performance by Day, mentioned to the 27-year-old Australian that he would pitch it in Friday morning for 59.<\/p><p>And that's when the light came on for Day.<\/p><p>He thought Conway Farms was a par 72 and that he had no chance at a 59. Now he does.<\/p><p>To be clear, pitching in from light rough 44 yards away is not the same as a putt to hit golf's magic number. Then again, the way Day has been playing, don't rule it out.<\/p><p>''If it goes in, it goes in,'' he said. ''Right now, I'm just trying to play the best I can. ... Obviously, I want to hole it. I wasn't really thinking about shooting 59. I obviously have got an opportunity tomorrow to do it, so that's pretty neat.''<\/p><p>Friday was shaping up as a long day because of weather, though with only a 69-man field - Jim Furyk had to withdraw with a wrist injury - it won't be a marathon.<\/p><p>THE DAY TRAIN: Day still has one hole to play in his opening round at the BMW Championship, but this number speaks to his play over the last two months. He is 89-under par dating to the British Open. That covers three victories - a major, World Golf Championship and FedEx Cup playoff event - and only two finishes out of the top 10.<\/p><p>And it left the Aussie tongue-tied on how to explain what was going on.<\/p><p>''It feels like a practice round, like it doesn't really matter,'' Day said. ''And no matter what you do, even if you hit a bad shot, it's going to be all right. That's kind of the way it feels. I mean, it's hard to explain because I'm just out there and I'm not really paying attention to the score and I'm hitting it down the middle and hitting it on the greens and holing putts.<\/p><p>''But I'm not really ... it's almost like you're ... I don't know, it's hard to ... I mean, it is what it is,'' he said, providing anything but clarity to the state of his mind. ''I'm just going out there trying to ... you asked me this bloody question. I can't answer it.''<\/p><p>THE BATTLE FOR NO. 1: Day said he really wasn't thinking about his chance to reach No. 1 in the world for the first time in his career when he played at the Deutsche Bank Championship two weeks ago. That's because he had to win, and he was never really in the hunt.<\/p><p>Now he is, even though he's just getting started.<\/p><p>Day already was four shots clear of Daniel Berger with one hole to play - 44 yards away for his second shot on No. 9 - and already looking like the guy to beat.<\/p><p>He would need at least a two-way tie for second, depending on how Rory McIlroy (No. 1) and Spieth (No. 2) fare, and it's looking inevitable.<\/p><p>THE BANTER: Day and Spieth have played the opening two rounds together in all three of these FedEx Cup playoff events, and they were paired in the final round of the PGA Championship. They already were friendly in the first place.<\/p><p>So when Day was going deep at Conway Farms, Spieth was providing the analysis.<\/p><p>Spieth made a hole-in-one on the second hole, and Day calmly poured in a 20-foot birdie. On the next hole, Spieth chipped in from 80 feet, and Day rapped in a 5-foot birdie. As he walked to the fourth tee, Spieth pointed over his shoulder at Day and said, ''He's still the clinic. I've barely got the (honors on the) tee.''<\/p><p>Two holes later as they crossed a bridge to the green, Day greeted a familiar face who said to him as a common greeting, ''How are you doing, Jason?''<\/p><p>This caused Spieth to stop, turn, smile and say, ''Really? You're asking him THAT?''<\/p><p>On the next hole, Day pounded a driver at the 352-yard seventh green and came up about 30 feet short. ''Good shot,'' Spieth said, shrugging to recognize that he stated the obvious. Quite.<\/p><p>THE STRETCH: Day and Spieth lit up Conway Farms even as the storms moved closer, especially on the first and second hole.<\/p><p>Day holed out from 79 yards in a bunker for eagle on the first hole. Spieth made a hole-in-one on the next hole. Spieth chipped in from 80 feet on the third hole, and Day made birdie with a 5-foot putt.<\/p><p>Here's the synopsis: They combined to play those three holes in 7 under and took only three putts between them.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10191111","10194386","10194391","10194396","10194401","10194406","10194411"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-18 02:23:29","updated_date":"2015-09-18 02:35:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150918022232622233408","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/18\/ap-glf-tee"}