{"old_nid":"10201906","title":"Tiger Woods has second microdiscectomy surgery on back","short_headline":"Tiger Woods has second microdiscectomy surgery on back","page_title":"Tiger Woods has second microdiscectomy surgery on back","slug":"AP-GLF--Tiger Woods-Surgery, 3rd Ld-Writethru","headline":"Tiger Woods has second microdiscectomy surgery on back","description":null,"body":"<p>With his game ailing, Tiger Woods announced he underwent a second microdiscectomy surgery on his back.<\/p><p>''This is certainly disappointing, but I'm a fighter,'' Woods said. ''I've been told I can make a full recovery, and I have no doubt that I will.''<\/p><p>Woods made the announcement on his website - www.tigerwoods.com - and reported the microsurgical procedure - intended to relieve pain from a pinched nerve - was performed late Wednesday in Park City, Utah, by neurosurgeon Dr. Charles Rich. Woods pulled out of three events he planned to play this year and isn't expected to return to the tour until January at the earliest.<\/p><p>Dr. Rich, who performed the initial operation in March 2014, called it ''a complete success.'' Woods was discharged Thursday.<\/p><p>The 14-time major champion hasn't won one of golf's four biggest events since the 2008 U.S. Open. Woods also has won more than 100 events worldwide, but none since the 2013 WGC-Bridgestone Invitational.<\/p><p>Woods canceled planned appearances in the Frys.com Open at Silverado in California and the Bridgestone America's Golf Cup in Mexico City next month and his own Hero World Challenge in the Bahamas in early December.<\/p><p>''I'd like to send my regrets to Frys and all those associated with the America's Golf Cup ... I will be attending my foundation-hosted Hero World Challenge but won't be able to play,'' Woods said.<\/p><p>After experiencing lingering discomfort in his back and hip, Woods elected to have surgery quickly in hopes of returning to the PGA Tour early in 2016, or as soon as possible. He is scheduled to begin rehabbing within a week.<\/p><p>''I appreciate the fans' concern and support,'' he said. ''This is unfortunate, but these things happen. I've been injured before and played again. It won't be any different this time.''<\/p><p>In his last tournament, Woods had a season-best 10th-place tie late last month in the Wyndham Championship in North Carolina. He played only 11 events this season, missing four cuts and withdrawing once, and has dropped to 283rd in the world ranking.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10201901","10202071"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-18 19:44:08","updated_date":"2015-09-18 19:50:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150918190929709791908","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/18\/ap-glf-tiger-woods-surgery"}