{"old_nid":"10085771","title":"Little Rickie keeps coming up big","short_headline":"Little Rickie keeps coming up big","page_title":"Little Rickie keeps coming up big","slug":"AP-GLF--Deutsche Bank","headline":"Little Rickie keeps coming up big","description":null,"body":"<p>NORTON, Mass. (AP)  Four months ago, the question was whether Rickie Fowler was winning as much as he should.<\/p><p>Three victories later, no one can question how he wins.<\/p><p>At The Players Championship, he finished birdie-eagle-birdie-birdie and then won a three-hole playoff over Sergio Garcia and Kevin Kisner. Two months later, he made birdie on three of the last four holes for a one-shot victory over Matt Kuchar and Raphael Jacquelin.<\/p><p>And in the Labor Day finish at the Deutsche Bank Championship, he was flawless on the back nine and rallied from a three-shot deficit to beat Henrik Stenson.<\/p><p>''It's pretty special to fight it out like that,'' Fowler said.<\/p><p>This time, he needed some help. Stenson led the entire round and never looked as though he was going to give Fowler an inch when he ended up giving him a mile on the par-3 16th hole. Stenson hit a towering 7-iron that he though was going to land in the middle of the green. Instead, it hit the front mounding, dropped down to the rocks and bounced into the water for a double bogey.<\/p><p>That effectively was the tournament.<\/p><p>Fowler, who made a 40-foot birdie putt on 14th to pull within one shot, suddenly was two shots ahead with two hole to play. And while he twice failed to convert birdie putts inside 10 feet over the final two holes, he didn't have to make them. Stenson couldn't catch him, Fowler closed with a 3-under 68 and a one-shot victory.<\/p><p>It moved him to No. 5 in the world and on the cusp of being part of this year's ''Big Three'' - Jordan Spieth, Rory McIlroy and Rickie Fowler.<\/p><p>''They've clearly played the best out of anyone over the past few months to couple of years,'' Fowler said. ''So I'm trying to be a small fourth thrown in there. But there's a lot of other really good young players playing well right now, as well.''<\/p><p>Spieth and Day each have four wins, all on the PGA Tour, and three of the four majors. McIlroy has three wins - Dubai, Match Play and the Wells Fargo Championship - and lost some momentum when he missed two months with an ankle injury.<\/p><p>Fowler hasn't been as consistently good as the other three this year, though he made this much clear on the TPC Boston. Get him near the lead on the back nine, or at least in the final hour of a tournament, and he's not going to back down.<\/p><p>What stood out from The Players, beyond his three birdies on the island-green 17th (two in a playoff) in one day, was his fearless and free swing when the pressure was at its peak. The 18th at the TPC Sawgrass is one of the toughest in golf, and Fowler split the middle twice in the final round.<\/p><p>Needing a birdie to win at Gullane No. 1 in the Scottish Open, he pounded his drive down the middle that set up birdie.<\/p><p>Clinging to a one-shot lead against Stenson on the par-5 18th, Fowler went with driver with a small margin of error because of the bunkers in the middle of the expansive fairway and trees to the left. He nailed it 341 yards, leaving him a 7-iron for his second shot.<\/p><p>''Luckily, there's just enough room down there in the neck. I hit it perfect. I made a great swing,'' Fowler said. ''And it's nice to be able to look back at The Players and the Scottish Open and remember the drives that I hit there to give me that little boost of confidence when I need it.''<\/p><p>Stenson lost as much as Fowler won.<\/p><p>Whether he had the wrong club (7-iron) or hit it poorly, he came up short and left on a hole with water short and left.<\/p><p>''I obviously pulled the wrong club on 16 and was trying to get the most out of a 7-iron into the wind and ballooned that one a little bit and that was the crucial mistake. Making double there was really a killer,'' Stenson said. ''I tried to get those two shots back or at least one to force a playoff on the last two holes and couldn't manage to do it.''<\/p><p>Stenson now has finished runner-up in both FedEx Cup playoff events (he was six shots behind Day at The Barclays), and he has been runner-up four times this year.<\/p><p>The consolation was moving to No. 4 in the FedEx Cup behind Day, Spieth and Fowler, still in the mix for a $10 million bonus at the Tour Championship.<\/p><p>Also still in the running are Hunter Mahan and William McGirt, both moving into the top 70 in the standings to advance to the third playoff event in two weeks. Mahan tied for fourth and kept alive his streak of playing every FedEx Cup playoff event since the series began in 2007. McGirt holed out with a 7-iron for eagle on the 17th hole, and that was enough to extend his season.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10085741","10085746","10085751","10085756","10085761","10085766"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-08 03:29:54","updated_date":"2015-09-08 03:37:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150908032918009883708","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/08\/ap-glf-deutsche-bank"}