{"old_nid":"10087936","title":"In golf, being No. 1 does not mean being No. 1 that week","short_headline":"In golf, being No. 1 does not mean being No. 1 that week","page_title":"In golf, being No. 1 does not mean being No. 1 that week","slug":"AP-GLF--On The Fringe-090815","headline":"In golf, being No. 1 does not mean being No. 1 that week","description":null,"body":"<p>NORTON, Mass. (AP)  Good news for the PGA Tour. The battle for No. 1 in the Official World Golf Ranking is so confounding that no one is complaining about all the points and projections of the FedEx Cup.<\/p><p>Give it time. The FedEx Cup still has two tournaments left before it awards $10 million to a player who might not have had the best year. Or might not win at all.<\/p><p>The world ranking?<\/p><p>That will be cleared up soon enough. For the moment, this is as bizarre as it has ever been.<\/p><p>Jordan Spieth made history Tuesday, just not the variety he would have wanted. There have been 61 changes at the top in the 30 years of the world ranking, and Spieth is the only one who got to No. 1 by missing the cut.<\/p><p>It gets better.<\/p><p>Rory McIlroy, who closed with a 66 at the Deutsche Bank Championship and tied for 29th, will return to No. 1 next Monday even though this is the one week of the season that the PGA Tour has no tournament. That gives McIlroy his own slice of world ranking history - a record third time he goes to No. 1 by sitting out the previous week.<\/p><p>Thankfully, McIlroy managed to provide a little clarity.<\/p><p>''It is what it is,'' he said.<\/p><p>Minus a tweak or two over the years, it is what it has always been. The world ranking is easy to mock at the moment because of the changes that are related more to when points are incrementally deducted over a two-year period. It's still based on results, just not the most recent.<\/p><p>Asked if he understood the math involved, McIlroy said, ''I left school when I was 15, but I understand it to a certain degree.''<\/p><p>Forget the math and consider the history.<\/p><p>During an eight-month stretch starting in September 1990, four players went to No. 1 by not playing the previous week - Nick Faldo (twice), Greg Norman and Ian Woosnam. Perhaps the greatest episode of musical chairs was the summer of 1997 when Tiger Woods, Ernie Els and Greg Norman were each No. 1 over three weeks. That was easier to stomach because Els (Buick Classic) and Norman (St. Jude Classic) won tournaments to get there.<\/p><p>It doesn't always work out that way.<\/p><p>Woods and David Duval traded time at the top of the ranking in the summer of 1999 when they met in the infamous ''Showdown at Sherwood,'' an 18-hole match that was billed as Monday Night Golf. Woods, who had returned to No. 1 a month earlier, pulled away when Duval hit the straightest drive of his career, right into the rock formation in the middle of the 16th fairway. Woods won, 2 and 1.<\/p><p>Both players took that week off from the tour and Duval went back to No. 1.<\/p><p>Duval's recollection of his return to No. 1 without playing is worth noting because for the longest time he had no recollection at all.<\/p><p>''The only way I can answer that is that it wasn't until a couple of years ago that I remember I went to No. 1 in August that year,'' Duval said Monday. ''Just getting there and being there awhile ... you know, I didn't much pay attention to it after that.''<\/p><p>Spieth knows the feeling. He got to No. 1 for the first time with a runner-up finish to Jason Day at the PGA Championship with a score that would have won all but two PGAs in more than a half-century of stroke play. He recalls crossing the third-base line to throw out the first pitch at a Texas Rangers game when he heard over the loudspeaker being introduced publicly for the first time as No. 1 in the world. It was a big deal.<\/p><p>McIlroy got there for the first time by holding off a late charge by Woods to win the Honda Classic in 2012.<\/p><p>''The first time is always sweeter,'' he said.<\/p><p>Trying to measure golfers from tours on all six continents where the game is played is impossible. The world ranking does a reasonable job making it plausible.<\/p><p>The fact a player can miss the cut - two in a row, in Spieth's case - and go to No. 1 is no reason to blow up the system and start over. And it would be rash to suggest that golf should be measured by one year instead of the current two-year formula.<\/p><p>Getting to No. 1 is no small achievement, and arguably more difficult than winning a major. Otherwise, it's little more than a conversation piece.<\/p><p>McIlroy has won seven times in the last two years with two majors in 2014. Spieth has won six times over the last two years with two majors in 2015. Over two years, it's a push. Over the last year, it's Spieth. Over the last three months, not many would argue against Jason Day.<\/p><p>''We all know who the best player is,'' McIlroy said, pausing to smile. ''And it's not me.''<\/p><p>Until next week, anyway.<\/p>","category_term":"9048","subcategory_term":null,"subcategory":null,"author_ref":null,"article_source":"AP","images_ref":["10056941","10060936","10087931"],"video_ref":null,"autoplay_video":"0","image_or_video":"0","caption":null,"credit":null,"related_content_ref":null,"enable_article_collection":null,"article_collection_ref":[],"incremental_type":null,"starting_number":null,"jump_links":null,"article_seo_path":null,"tags":"Golf","ad_tags":"","people_ref":[],"events_ref":[],"publish_date":"2015-09-08 10:54:18","updated_date":"2015-09-08 11:05:00","syndication":"1","not_searchable":"0","disable_comments":"0","comments":null,"legacy_id":"20150908105357645026008","contributors_ref":null,"eyebrow":null,"galleries_ref":[],"url_alias":"golf\/2015\/09\/08\/ap-glf-fringe-090815"}